{"problem": "The number of adult sidewinder rattlesnake in Radiance Reservoir equals the difference between the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult grebe in Crystalmirror Waters equals the sum of the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult cormorant in Dreamcatcher Basin equals the number of adult crow in Hamilton Farm. The number of adult bandicoot in Moonveil Lake equals the difference between the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult flamingo in Crystalmirror Waters equals the number of adult crow in Mayer Aquarium. The number of adult caribou in Crystalmirror Waters equals the sum of the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult chaetognath in Dreamcatcher Basin equals the number of adult crow in Mayer Aquarium. The number of adult razorbill in Dreamcatcher Basin equals the difference between the number of adult crow in Mayer Aquarium and the total number of adult animals in Hamilton Farm. The number of adult rock wallaby in Moonveil Lake equals the difference between the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult penguin in Radiance Reservoir equals the difference between the total number of adult animals in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult dromedary camel in Radiance Reservoir equals the total number of adult animals in Hamilton Farm. The number of adult frigatebird in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult sand cat in Radiance Reservoir equals the sum of the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult kangaroo rat in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the number of adult owl in Jefferson Circus. The number of adult scorpion in Radiance Reservoir equals the number of adult crow in Hamilton Farm. The number of adult dinoflagellate in Dreamcatcher Basin equals the difference between the number of adult owl in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult antlion in Moonveil Lake equals the difference between the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult leopard seal in Crystalmirror Waters equals the sum of the total number of adult animals in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult roadrunner in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the total number of adult animals in Glowglass Pond. The number of adult shearwater in Crystalmirror Waters equals the sum of the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult oryx in Radiance Reservoir equals the number of adult crow in Hamilton Farm. The number of adult gull in Dreamcatcher Basin equals the total number of adult animals in Hamilton Farm. The number of adult harp seal in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult firefly in Moonveil Lake equals the sum of the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult katydid in Moonveil Lake equals the number of adult crow in Hamilton Farm. The number of adult crow in Mayer Aquarium equals the total number of adult animals in Hamilton Farm. The number of adult cormorant in Crystalmirror Waters equals the difference between the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult owl in Jefferson Circus equals 3. The number of adult crow in Hamilton Farm equals 3. The number of adult sugar glider in Moonveil Lake equals the number of adult crow in Hamilton Farm. The number of adult gannet in Crystalmirror Waters equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult potoroo in Moonveil Lake equals the number of adult owl in Jefferson Circus. The number of adult sandpiper in Crystalmirror Waters equals the total number of adult animals in Hamilton Farm. The number of adult albatross in Dreamcatcher Basin equals the difference between the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult euphausiid in Dreamcatcher Basin equals the number of adult crow in Mayer Aquarium. The number of adult weka in Radiance Reservoir equals the number of adult crow in Mayer Aquarium. The number of adult kittiwake in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult greenland shark in Crystalmirror Waters equals the difference between the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult komodo dragon in Glowglass Pond equals the number of adult owl in Jefferson Circus. The number of adult butterfly in Moonveil Lake equals the sum of the number of adult crow in Mayer Aquarium and the total number of adult animals in Hamilton Farm. The number of adult egret in Crystalmirror Waters equals the difference between the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult gull in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult walking stick in Moonveil Lake equals the total number of adult animals in Hamilton Farm. The number of adult coyote in Radiance Reservoir equals the sum of the total number of adult animals in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult ostrich in Radiance Reservoir equals the total number of adult animals in Hamilton Farm. The number of adult kangaroo in Moonveil Lake equals the sum of the number of adult crow in Mayer Aquarium and the number of adult owl in Jefferson Circus. The number of adult takahe in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult acantharian in Dreamcatcher Basin equals the total number of adult animals in Hamilton Farm. The number of adult puffin in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult desert hedgehog in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the number of adult owl in Jefferson Circus. The number of adult foraminifera in Dreamcatcher Basin equals the difference between the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult camel in Radiance Reservoir equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult phytoplankton in Dreamcatcher Basin equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult copepod in Dreamcatcher Basin equals the sum of the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult heron in Crystalmirror Waters equals the sum of the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult albatross in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult king eider in Crystalmirror Waters equals the number of adult crow in Mayer Aquarium. The number of adult skimmer in Dreamcatcher Basin equals the number of adult owl in Jefferson Circus. The number of adult penguin in Dreamcatcher Basin equals the sum of the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult cladoceran in Dreamcatcher Basin equals the difference between the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult ross's gull in Crystalmirror Waters equals the difference between the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult bettong in Moonveil Lake equals the number of adult owl in Jefferson Circus. The number of adult grasshopper in Moonveil Lake equals the difference between the number of adult owl in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult stick insect in Moonveil Lake equals the number of adult owl in Jefferson Circus. The number of adult shearwater in Dreamcatcher Basin equals the number of adult crow in Mayer Aquarium. The number of adult rotifer in Dreamcatcher Basin equals the total number of adult animals in Hamilton Farm. The number of adult puffin in Crystalmirror Waters equals the sum of the total number of adult animals in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult chimpanzee in Ethereal Pool equals the sum of the total number of adult animals in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult mayfly in Moonveil Lake equals the difference between the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult beaver in Azure Abyss equals the total number of adult animals in Hamilton Farm. The number of adult booby in Crystalmirror Waters equals the difference between the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult meerkat in Radiance Reservoir equals the number of adult crow in Mayer Aquarium. The number of adult cyanobacteria in Dreamcatcher Basin equals the total number of adult animals in Hamilton Farm. The number of adult arctic fox in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult quokka in Moonveil Lake equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult puffin in Dreamcatcher Basin equals the sum of the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult goliath beetle in Moonveil Lake equals the number of adult crow in Hamilton Farm. The number of adult steamer duck in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the number of adult owl in Jefferson Circus. The number of adult dung beetle in Moonveil Lake equals the sum of the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult numbat in Moonveil Lake equals the sum of the total number of adult animals in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult collared lemming in Crystalmirror Waters equals the sum of the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult pteropod in Dreamcatcher Basin equals the total number of adult animals in Hamilton Farm. The number of adult hornet in Moonveil Lake equals the number of adult crow in Hamilton Farm. The number of adult dolphin in Sparkflow Lagoon equals the difference between the total number of adult animals in Hamilton Farm and the total number of adult animals in Dreamcatcher Basin. The number of adult zooplankton in Dreamcatcher Basin equals the number of adult owl in Jefferson Circus. The number of adult penguin in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult thorny devil in Radiance Reservoir equals the sum of the total number of adult animals in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult rhea in Radiance Reservoir equals the number of adult crow in Mayer Aquarium. The number of adult praying mantis in Moonveil Lake equals the number of adult owl in Jefferson Circus. The number of adult opossum in Moonveil Lake equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult atlas moth in Moonveil Lake equals the total number of adult animals in Hamilton Farm. The number of adult walrus in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult polar bear in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult egret in Dreamcatcher Basin equals the total number of adult animals in Hamilton Farm. The number of adult tintinnid in Dreamcatcher Basin equals the number of adult crow in Mayer Aquarium. The number of adult larvacean in Dreamcatcher Basin equals the number of adult owl in Jefferson Circus. The number of adult addax in Radiance Reservoir equals the sum of the number of adult crow in Hamilton Farm and the total number of adult animals in Sparkflow Lagoon. The number of adult narwhal in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult frigatebird in Dreamcatcher Basin equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult heron in Dreamcatcher Basin equals the difference between the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult musk ox in Crystalmirror Waters equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult silkworm in Moonveil Lake equals the sum of the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult tasmanian devil in Moonveil Lake equals the number of adult crow in Mayer Aquarium. The number of adult brush-tailed possum in Moonveil Lake equals the difference between the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult wallaby in Moonveil Lake equals the difference between the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult dovekie in Dreamcatcher Basin equals the number of adult owl in Jefferson Circus. The number of adult arctic tern in Crystalmirror Waters equals the difference between the number of adult crow in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult skimmer in Crystalmirror Waters equals the number of adult crow in Mayer Aquarium. The number of adult noctiluca in Dreamcatcher Basin equals the difference between the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult ladybug in Moonveil Lake equals the number of adult crow in Mayer Aquarium. The number of adult arctic hare in Crystalmirror Waters equals the number of adult crow in Hamilton Farm. The number of adult kiwi in Radiance Reservoir equals the number of adult owl in Jefferson Circus. The number of adult beluga whale in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult sandpiper in Dreamcatcher Basin equals the number of adult crow in Hamilton Farm. The number of adult arctic wolf in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult jerboa in Radiance Reservoir equals the sum of the number of adult crow in Hamilton Farm and the total number of adult animals in Hamilton Farm. The number of adult long-nosed bandicoot in Moonveil Lake equals the total number of adult animals in Hamilton Farm. The number of adult flamingo in Dreamcatcher Basin equals the number of adult crow in Hamilton Farm. The number of adult horned lizard in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult mosquito in Moonveil Lake equals the sum of the number of adult owl in Jefferson Circus and the total number of adult animals in Hamilton Farm. The number of adult tern in Crystalmirror Waters equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult marsupial mole in Moonveil Lake equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult pelican in Dreamcatcher Basin equals the sum of the number of adult crow in Mayer Aquarium and the number of adult owl in Jefferson Circus. The number of adult thaliacean in Dreamcatcher Basin equals the sum of the number of adult crow in Mayer Aquarium and the total number of adult animals in Moonveil Lake. The number of adult desert locust in Radiance Reservoir equals the difference between the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult kittiwake in Dreamcatcher Basin equals the difference between the number of adult crow in Mayer Aquarium and the total number of adult animals in Hamilton Farm. The number of adult snowy owl in Crystalmirror Waters equals the total number of adult animals in Hamilton Farm. The number of adult wombat in Moonveil Lake equals the total number of adult animals in Hamilton Farm. The number of adult diatom in Dreamcatcher Basin equals the sum of the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult salp in Dreamcatcher Basin equals the sum of the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult fennec fox in Radiance Reservoir equals the number of adult owl in Jefferson Circus. The number of adult razorbill in Crystalmirror Waters equals the total number of adult animals in Hamilton Farm. The number of adult cicada in Moonveil Lake equals the number of adult crow in Hamilton Farm. The number of adult tern in Dreamcatcher Basin equals the number of adult crow in Hamilton Farm. The number of adult bowhead whale in Crystalmirror Waters equals the number of adult crow in Mayer Aquarium. The number of adult golden mole in Radiance Reservoir equals the difference between the number of adult crow in Mayer Aquarium and the total number of adult animals in Hamilton Farm. The number of adult grebe in Dreamcatcher Basin equals the difference between the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult dragonfly in Moonveil Lake equals the sum of the number of adult crow in Mayer Aquarium and the number of adult crow in Hamilton Farm. The number of adult ivory gull in Crystalmirror Waters equals the number of adult owl in Jefferson Circus. The number of adult booby in Dreamcatcher Basin equals the number of adult crow in Hamilton Farm. The number of adult gila monster in Radiance Reservoir equals the sum of the total number of adult animals in Hamilton Farm and the total number of adult animals in Ethereal Pool. The number of adult amphipod in Dreamcatcher Basin equals the number of adult crow in Mayer Aquarium. The number of adult pelican in Crystalmirror Waters equals the difference between the number of adult crow in Hamilton Farm and the number of adult owl in Jefferson Circus. The number of adult cassowary in Radiance Reservoir equals the sum of the number of adult crow in Mayer Aquarium and the total number of adult animals in Hamilton Farm. The number of adult thylacine in Moonveil Lake equals the difference between the number of adult crow in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult koala in Moonveil Lake equals the difference between the number of adult crow in Mayer Aquarium and the number of adult owl in Jefferson Circus. The number of adult eastern quoll in Moonveil Lake equals the total number of adult animals in Hamilton Farm. The number of adult dovekie in Crystalmirror Waters equals the number of adult crow in Mayer Aquarium. The number of adult emu in Radiance Reservoir equals the number of adult crow in Hamilton Farm. The number of adult gannet in Dreamcatcher Basin equals the difference between the number of adult owl in Jefferson Circus and the number of adult crow in Mayer Aquarium. The number of adult desert tortoise in Radiance Reservoir equals the difference between the number of adult crow in Hamilton Farm and the total number of adult animals in Azure Abyss. The number of adult bilby in Moonveil Lake equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Mayer Aquarium. The number of adult wasp in Moonveil Lake equals the sum of the number of adult owl in Jefferson Circus and the total number of adult animals in Crystalmirror Waters. The number of adult leafhopper in Moonveil Lake equals the difference between the total number of adult animals in Hamilton Farm and the number of adult crow in Hamilton Farm. The number of adult radiolaria in Dreamcatcher Basin equals the sum of the number of adult crow in Mayer Aquarium and the total number of adult animals in Hamilton Farm. The number of adult tree kangaroo in Moonveil Lake equals the sum of the number of adult owl in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult kakapo in Radiance Reservoir equals the sum of the total number of adult animals in Hamilton Farm and the number of adult owl in Jefferson Circus. ", "question": "How many adult crow does Mayer Aquarium have?", "solution": "Define adult crow in Hamilton Farm as i; so i = 3. Define total number of adult animals in Hamilton Farm as P; so P = i = 3. Define adult crow in Mayer Aquarium as U; so U = P = 3. Answer: 3.", "op": 3, "id": 14, "template": "crazy_zootopia", "mode": "normalforward", "length": "8k", "d": 2}
{"problem": "The number of adult macaque in Luminous Harbor equals the sum of the number of adult owl in Maple Creek and the number of adult owl in Beverly Forest. The number of adult capuchin in Luminous Harbor equals the difference between the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult rockhopper penguin in Skyspire City equals the sum of the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult moray eel in Celestial Arch equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult blue whale in Ecliptica Dome equals the total number of adult animals in Maple Creek. The number of adult tamarin in Luminous Harbor equals the number of adult eagle in Beverly Forest. The number of adult lionfish in Celestial Arch equals the sum of the number of adult owl in Beverly Forest and the number of adult eagle in Beverly Forest. The number of adult jerboa in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Maple Creek. The number of adult gila monster in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Maple Creek. The number of adult bettas in Celestial Arch equals the difference between the number of adult owl in Maple Creek and the number of adult owl in Beverly Forest. The number of adult yellow tang in Celestial Arch equals the sum of the number of adult eagle in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult phoenix in Celestial Arch equals the sum of the number of adult owl in Beverly Forest and the number of adult eagle in Beverly Forest. The number of adult clownfish in Skyspire City equals the number of adult owl in Beverly Forest. The number of adult coyote in Nimbus Haven equals the difference between the total number of adult animals in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult meerkat in Nimbus Haven equals the total number of adult animals in Maple Creek. The number of adult kitsune in Celestial Arch equals the difference between the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult coelacanth in Celestial Arch equals the total number of adult animals in Maple Creek. The number of adult flightless cormorant in Nimbus Haven equals the total number of adult animals in Maple Creek. The number of adult subantarctic penguin in Skyspire City equals the number of adult owl in Beverly Forest. The number of adult colobus monkey in Luminous Harbor equals the number of adult owl in Beverly Forest. The number of adult kakapo in Nimbus Haven equals the number of adult owl in Beverly Forest. The number of adult eagle in Beverly Forest equals 1. The number of adult tyrannosaurus rex in Nebula City equals the sum of the total number of adult animals in Maple Creek and the number of adult owl in Maple Creek. The number of adult parrotfish in Skyspire City equals the number of adult owl in Beverly Forest. The number of adult sea urchin in Skyspire City equals the number of adult owl in Maple Creek. The number of adult nemean lion in Celestial Arch equals the difference between the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult butterflyfish in Skyspire City equals the number of adult owl in Maple Creek. The number of adult adélie penguin in Skyspire City equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult magellanic penguin in Skyspire City equals the sum of the number of adult owl in Beverly Forest and the number of adult eagle in Beverly Forest. The number of adult crested gecko in Luminous Harbor equals the difference between the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult humboldt penguin in Skyspire City equals the sum of the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult galápagos penguin in Skyspire City equals the number of adult eagle in Beverly Forest. The number of adult desert locust in Nimbus Haven equals the number of adult owl in Beverly Forest. The number of adult mandrill in Luminous Harbor equals the difference between the total number of adult animals in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult little blue penguin in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult white-flippered penguin in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult pegasus in Celestial Arch equals the sum of the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult guppy in Celestial Arch equals the number of adult owl in Maple Creek. The number of adult komodo dragon in Luminous Harbor equals the difference between the number of adult owl in Beverly Forest and the number of adult eagle in Beverly Forest. The number of adult fennec fox in Nimbus Haven equals the number of adult eagle in Beverly Forest. The number of adult gobies in Skyspire City equals the number of adult owl in Maple Creek. The number of adult hammerhead shark in Celestial Arch equals the number of adult owl in Beverly Forest. The number of adult howler monkey in Luminous Harbor equals the sum of the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult royal penguin in Skyspire City equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult manta ray in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult ostrich in Starweaver's Crest equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult squirrel monkey in Luminous Harbor equals the difference between the total number of adult animals in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult marine iguana in Luminous Harbor equals the sum of the number of adult owl in Beverly Forest and the total number of adult animals in Skyspire City. The number of adult orangutan in Luminous Harbor equals the sum of the number of adult owl in Beverly Forest and the total number of adult animals in Starweaver's Crest. The number of adult roc in Celestial Arch equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult gelada in Luminous Harbor equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Maple Creek. The number of adult unicorn in Celestial Arch equals the number of adult eagle in Beverly Forest. The number of adult gibbon in Luminous Harbor equals the sum of the number of adult owl in Beverly Forest and the number of adult eagle in Beverly Forest. The number of adult fenrir in Celestial Arch equals the total number of adult animals in Maple Creek. The number of adult weka in Nimbus Haven equals the total number of adult animals in Maple Creek. The number of adult magellanic penguin in Nimbus Haven equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult chimpanzee in Aetherhold equals the difference between the total number of adult animals in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult erect-crested penguin in Skyspire City equals the difference between the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult clownfish in Celestial Arch equals the number of adult owl in Beverly Forest. The number of adult blue monkey in Luminous Harbor equals the sum of the number of adult eagle in Beverly Forest and the total number of adult animals in Ecliptica Dome. The number of adult goblin shark in Celestial Arch equals the total number of adult animals in Maple Creek. The number of adult spiny lobster in Skyspire City equals the number of adult eagle in Beverly Forest. The number of adult surgeonfish in Celestial Arch equals the number of adult eagle in Beverly Forest. The number of adult kangaroo rat in Nimbus Haven equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult boxfish in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult barracuda in Celestial Arch equals the number of adult owl in Beverly Forest. The number of adult african penguin in Skyspire City equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Maple Creek. The number of adult griffin in Celestial Arch equals the total number of adult animals in Maple Creek. The number of adult starfish in Skyspire City equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult angelfish in Celestial Arch equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult fairy penguin in Skyspire City equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult leviathan in Celestial Arch equals the number of adult eagle in Beverly Forest. The number of adult basilisk in Celestial Arch equals the difference between the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult triggerfish in Skyspire City equals the number of adult eagle in Beverly Forest. The number of adult proboscis monkey in Luminous Harbor equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult fiordland penguin in Skyspire City equals the sum of the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult dragon in Celestial Arch equals the difference between the number of adult owl in Beverly Forest and the number of adult eagle in Beverly Forest. The number of adult dodo in Nimbus Haven equals the total number of adult animals in Maple Creek. The number of adult desert tortoise in Nimbus Haven equals the number of adult owl in Maple Creek. The number of adult kraken in Celestial Arch equals the sum of the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult moray eel in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult camel in Nimbus Haven equals the difference between the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult great auk in Nimbus Haven equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult steamer duck in Nimbus Haven equals the sum of the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult emu in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult golden mole in Nimbus Haven equals the total number of adult animals in Maple Creek. The number of adult owl in Maple Creek equals the number of adult eagle in Beverly Forest. The number of adult moloch (thorny devil) in Luminous Harbor equals the sum of the total number of adult animals in Maple Creek and the number of adult owl in Maple Creek. The number of adult horned lizard in Nimbus Haven equals the sum of the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult sand cat in Nimbus Haven equals the difference between the total number of adult animals in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult frilled lizard in Luminous Harbor equals the sum of the total number of adult animals in Maple Creek and the number of adult owl in Maple Creek. The number of adult marlin in Celestial Arch equals the number of adult owl in Maple Creek. The number of adult macaroni penguin in Skyspire City equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult minotaur in Celestial Arch equals the total number of adult animals in Maple Creek. The number of adult blue-tongue skink in Luminous Harbor equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Nebula City. The number of adult hydra in Celestial Arch equals the total number of adult animals in Maple Creek. The number of adult rhea in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult archerfish in Celestial Arch equals the number of adult eagle in Beverly Forest. The number of adult moas in Nimbus Haven equals the difference between the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult sea cucumber in Skyspire City equals the number of adult owl in Beverly Forest. The number of adult pufferfish in Celestial Arch equals the number of adult eagle in Beverly Forest. The number of adult owl in Beverly Forest equals 1. The number of adult cassowary in Nimbus Haven equals the number of adult owl in Maple Creek. The number of adult yellow-eyed penguin in Skyspire City equals the difference between the number of adult owl in Beverly Forest and the total number of adult animals in Nimbus Haven. The number of adult sidewinder rattlesnake in Nimbus Haven equals the number of adult eagle in Beverly Forest. The number of adult chimpanzee in Luminous Harbor equals the difference between the number of adult eagle in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult takahe in Nimbus Haven equals the number of adult owl in Maple Creek. The number of adult desert hedgehog in Nimbus Haven equals the sum of the number of adult owl in Maple Creek and the number of adult owl in Beverly Forest. The number of adult tinamous in Nimbus Haven equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult harlequin shrimp in Skyspire City equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult siamese fighting fish in Celestial Arch equals the sum of the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult damselfish in Skyspire City equals the number of adult owl in Beverly Forest. The number of adult king penguin in Nimbus Haven equals the number of adult owl in Maple Creek. The number of adult snares penguin in Skyspire City equals the number of adult eagle in Beverly Forest. The number of adult butterflyfish in Celestial Arch equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult centaur in Celestial Arch equals the sum of the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult sea anemone in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult vervet monkey in Luminous Harbor equals the total number of adult animals in Maple Creek. The number of adult dromedary camel in Nimbus Haven equals the difference between the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult cleaner shrimp in Skyspire City equals the number of adult owl in Maple Creek. The number of adult ostrich in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult kiwi in Nimbus Haven equals the difference between the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult bearded dragon in Luminous Harbor equals the number of adult eagle in Beverly Forest. The number of adult night monkey in Luminous Harbor equals the sum of the number of adult eagle in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult galápagos penguin in Nimbus Haven equals the number of adult eagle in Beverly Forest. The number of adult sea slug in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult stingray in Celestial Arch equals the difference between the total number of adult animals in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult gentoo penguin in Skyspire City equals the number of adult owl in Maple Creek. The number of adult patas monkey in Luminous Harbor equals the sum of the number of adult eagle in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult manticore in Celestial Arch equals the sum of the number of adult eagle in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult green iguana in Luminous Harbor equals the number of adult owl in Maple Creek. The number of adult roadrunner in Nimbus Haven equals the number of adult owl in Maple Creek. The number of adult thorny devil in Nimbus Haven equals the number of adult owl in Maple Creek. The number of adult hawkfish in Skyspire City equals the number of adult owl in Maple Creek. The number of adult blue tang in Celestial Arch equals the difference between the number of adult eagle in Beverly Forest and the number of adult owl in Maple Creek. The number of adult panther chameleon in Luminous Harbor equals the difference between the number of adult owl in Maple Creek and the total number of adult animals in Maple Creek. The number of adult selkie in Celestial Arch equals the number of adult eagle in Beverly Forest. The number of adult cerberus in Celestial Arch equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Maple Creek. The number of adult elephant bird in Nimbus Haven equals the sum of the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult penguin in Nimbus Haven equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult lionfish in Skyspire City equals the difference between the number of adult owl in Beverly Forest and the total number of adult animals in Maple Creek. The number of adult chimera in Celestial Arch equals the number of adult owl in Beverly Forest. The number of adult oryx in Nimbus Haven equals the difference between the number of adult eagle in Beverly Forest and the number of adult owl in Beverly Forest. The number of adult little blue penguin in Skyspire City equals the total number of adult animals in Maple Creek. The number of adult golden lion tamarin in Luminous Harbor equals the difference between the number of adult owl in Beverly Forest and the total number of adult animals in Celestial Arch. The number of adult bonobo in Luminous Harbor equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Maple Creek. The number of adult pipefish in Skyspire City equals the number of adult owl in Maple Creek. The number of adult emperor penguin in Skyspire City equals the difference between the total number of adult animals in Maple Creek and the number of adult owl in Beverly Forest. The number of adult baboon in Luminous Harbor equals the number of adult eagle in Beverly Forest. The number of adult leopard gecko in Luminous Harbor equals the difference between the number of adult owl in Beverly Forest and the number of adult owl in Maple Creek. The number of adult scorpion in Nimbus Haven equals the number of adult eagle in Beverly Forest. The number of adult chinstrap penguin in Skyspire City equals the number of adult owl in Maple Creek. The number of adult hippogriff in Celestial Arch equals the difference between the number of adult eagle in Beverly Forest and the number of adult owl in Maple Creek. The number of adult spider monkey in Luminous Harbor equals the difference between the total number of adult animals in Maple Creek and the total number of adult animals in Aetherhold. The number of adult king penguin in Skyspire City equals the sum of the number of adult owl in Maple Creek and the number of adult owl in Beverly Forest. The number of adult electric eel in Celestial Arch equals the sum of the number of adult owl in Maple Creek and the number of adult eagle in Beverly Forest. The number of adult addax in Nimbus Haven equals the difference between the number of adult owl in Maple Creek and the number of adult owl in Beverly Forest. ", "question": "What is the total number of adult animals in Maple Creek?", "solution": "Define adult eagle in Beverly Forest as E; so E = 1. Define adult owl in Maple Creek as p; so p = E = 1. Define total number of adult animals in Maple Creek as C; so C = p = 1. Answer: 1.", "op": 3, "id": 16, "template": "crazy_zootopia", "mode": "normalforward", "length": "8k", "d": 2}
{"problem": "The number of martial arts discipline school in Winterhaven equals the total number of schools in Ruby Bay. The number of gregorian chant conservatory in Chillbrook equals the number of culinarian school in Shoreline City. The number of interactive media conservatory in Snowveil equals the sum of the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of debate and rhetoric school in Chillbrook equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of school of moral philosophy in Glacierport equals the sum of the total number of schools in Ruby Bay and the number of culinarian school in Shoreline City. The number of sufi music institute in Chillbrook equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of school of botany in Coldspire equals the total number of schools in Ruby Bay. The number of astronomy institute in Coldspire equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of international diplomacy academy in Frostford equals the number of culinarian school in Ruby Bay. The number of school of artificial lifeforms in Winterhaven equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of soccer development academy in Winterhaven equals the number of public highschool in Clearwater Bay. The number of school of cloning ethics in Winterhaven equals the difference between the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of school of drone engineering in Frozen Hollow equals the difference between the number of culinarian school in Shoreline City and the total number of schools in Winterhaven. The number of school of ancient dialects in Glacierport equals the total number of schools in Ruby Bay. The number of school of extreme sports in Winterhaven equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Ruby Bay. The number of school of artisan textiles in Snowveil equals the number of culinarian school in Ruby Bay. The number of digital content creation school in Snowveil equals the number of culinarian school in Ruby Bay. The number of school of sailing and navigation in Winterhaven equals the difference between the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. The number of school of online media strategy in Icicle Hollow equals the number of culinarian school in Shoreline City. The number of real estate management academy in Coldspire equals the difference between the number of public highschool in Clearwater Bay and the total number of schools in Ruby Bay. The number of corporate strategy institute in Frostford equals the total number of schools in Ruby Bay. The number of school of pattern design in Snowveil equals the number of culinarian school in Shoreline City. The number of school of renewable energy research in Frostford equals the total number of schools in Ruby Bay. The number of professional climbing academy in Winterhaven equals the number of culinarian school in Ruby Bay. The number of school of journalism excellence in Glacierport equals the sum of the number of public highschool in Clearwater Bay and the total number of schools in Ruby Bay. The number of virtual reality development institute in Icicle Hollow equals the number of culinarian school in Ruby Bay. The number of indigenous wisdom school in Chillbrook equals the difference between the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of school of journalism excellence in Chillbrook equals the number of culinarian school in Ruby Bay. The number of genetics and biotech institute in Frostford equals the sum of the number of culinarian school in Shoreline City and the number of public highschool in Clearwater Bay. The number of interactive media conservatory in Icicle Hollow equals the total number of schools in Ruby Bay. The number of school of sign language in Chillbrook equals the number of public highschool in Clearwater Bay. The number of school of bioinformatics in Frostford equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of cricket excellence academy in Winterhaven equals the number of public highschool in Clearwater Bay. The number of school of fine furniture design in Snowveil equals the total number of schools in Ruby Bay. The number of school of archaeology in Coldspire equals the number of public highschool in Clearwater Bay. The number of school of terraforming in Winterhaven equals the sum of the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of marine biology academy in Coldspire equals the sum of the total number of schools in Ruby Bay and the number of culinarian school in Shoreline City. The number of school of public administration in Frostford equals the difference between the number of culinarian school in Shoreline City and the total number of schools in Ruby Bay. The number of talmudic studies academy in Chillbrook equals the number of culinarian school in Ruby Bay. The number of school of sign language in Glacierport equals the number of culinarian school in Ruby Bay. The number of school of bioethics in Glacierport equals the number of public highschool in Clearwater Bay. The number of holographic design school in Frozen Hollow equals the difference between the total number of schools in Ruby Bay and the number of public highschool in Clearwater Bay. The number of school of video game design in Snowveil equals the number of public highschool in Clearwater Bay. The number of digital marketing conservatory in Coldspire equals the sum of the total number of schools in Ruby Bay and the number of public highschool in Clearwater Bay. The number of school of forest ecology in Icicle Hollow equals the sum of the number of public highschool in Clearwater Bay and the number of culinarian school in Ruby Bay. The number of school of nanobot engineering in Winterhaven equals the difference between the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. The number of leathercraft conservatory in Snowveil equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Ruby Bay. The number of academy of motion graphics in Snowveil equals the total number of schools in Ruby Bay. The number of school of mythology in Coldspire equals the sum of the total number of schools in Ruby Bay and the number of culinarian school in Ruby Bay. The number of marine mammal research institute in Icicle Hollow equals the total number of schools in Ruby Bay. The number of oceanography and deep sea studies academy in Frostford equals the number of public highschool in Clearwater Bay. The number of broadcast media training institute in Chillbrook equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Ruby Bay. The number of school of corporate ethics in Coldspire equals the difference between the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of speech therapy institute in Glacierport equals the number of public highschool in Clearwater Bay. The number of fine arts conservatory in Coldspire equals the number of culinarian school in Ruby Bay. The number of school of user experience design in Snowveil equals the number of culinarian school in Shoreline City. The number of business analytics academy in Coldspire equals the total number of schools in Ruby Bay. The number of school of renewable energy in Frozen Hollow equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Ruby Bay. The number of school of habitat studies in Icicle Hollow equals the difference between the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of virtual reality training institute in Frozen Hollow equals the number of public highschool in Clearwater Bay. The number of academy of motion graphics in Icicle Hollow equals the difference between the number of culinarian school in Shoreline City and the total number of schools in Ruby Bay. The number of tibetan buddhist philosophy school in Chillbrook equals the sum of the number of public highschool in Clearwater Bay and the total number of schools in Ruby Bay. The number of zen meditation school in Chillbrook equals the sum of the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. The number of school of precision watchmaking in Snowveil equals the number of culinarian school in Shoreline City. The number of space exploration institute in Frozen Hollow equals the number of culinarian school in Ruby Bay. The number of digital content creation school in Icicle Hollow equals the difference between the number of culinarian school in Ruby Bay and the number of culinarian school in Shoreline City. The number of custom footwear institute in Snowveil equals the sum of the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of cybersecurity academy in Coldspire equals the number of public highschool in Clearwater Bay. The number of interpreter training academy in Glacierport equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of school of conflict resolution in Frostford equals the sum of the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of school of coral reef studies in Icicle Hollow equals the number of culinarian school in Shoreline City. The number of creative writing conservatory in Chillbrook equals the number of culinarian school in Ruby Bay. The number of augmented reality training institute in Icicle Hollow equals the number of public highschool in Clearwater Bay. The number of interpreter training academy in Chillbrook equals the sum of the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of virtual reality development institute in Snowveil equals the number of culinarian school in Ruby Bay. The number of school of mobile app development in Icicle Hollow equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Ruby Bay. The number of school of time travel theory in Winterhaven equals the difference between the total number of schools in Ruby Bay and the total number of schools in Chillbrook. The number of school of microbiology in Frostford equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of school of behavioral economics in Coldspire equals the sum of the number of public highschool in Clearwater Bay and the total number of schools in Frozen Hollow. The number of environmental ethics institute in Glacierport equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of avian studies academy in Icicle Hollow equals the total number of schools in Ruby Bay. The number of ecological restoration institute in Icicle Hollow equals the difference between the total number of schools in Ruby Bay and the number of public highschool in Clearwater Bay. The number of storytelling arts academy in Glacierport equals the number of culinarian school in Shoreline City. The number of school of metaphysics in Glacierport equals the sum of the total number of schools in Ruby Bay and the number of culinarian school in Ruby Bay. The number of shinto cultural academy in Chillbrook equals the sum of the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of critical thinking and logic academy in Glacierport equals the difference between the number of culinarian school in Shoreline City and the number of culinarian school in Ruby Bay. The number of digital storytelling academy in Icicle Hollow equals the difference between the number of public highschool in Clearwater Bay and the total number of schools in Frostford. The number of eastern philosophy conservatory in Glacierport equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of school of artificial intelligence in Frozen Hollow equals the sum of the number of culinarian school in Ruby Bay and the number of culinarian school in Shoreline City. The number of hindu vedic school in Chillbrook equals the number of culinarian school in Ruby Bay. The number of startup incubation academy in Coldspire equals the sum of the number of culinarian school in Ruby Bay and the number of culinarian school in Shoreline City. The number of school of video game design in Icicle Hollow equals the sum of the number of culinarian school in Shoreline City and the total number of schools in Ruby Bay. The number of digital storytelling academy in Snowveil equals the total number of schools in Ruby Bay. The number of school of ancient dialects in Chillbrook equals the number of culinarian school in Ruby Bay. The number of experimental physics academy in Frostford equals the number of culinarian school in Shoreline City. The number of school of existential studies in Glacierport equals the total number of schools in Ruby Bay. The number of broadcast media training institute in Glacierport equals the number of culinarian school in Shoreline City. The number of olympic training institute in Winterhaven equals the sum of the total number of schools in Ruby Bay and the number of public highschool in Clearwater Bay. The number of global linguistics academy in Chillbrook equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Snowveil. The number of e-commerce institute in Coldspire equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Shoreline City. The number of woodcarving and restoration academy in Snowveil equals the total number of schools in Ruby Bay. The number of school of mobile app development in Snowveil equals the number of public highschool in Clearwater Bay. The number of school of conservation biology in Icicle Hollow equals the total number of schools in Ruby Bay. The number of academy of rational thought in Glacierport equals the sum of the number of culinarian school in Ruby Bay and the number of culinarian school in Shoreline City. The number of debate and rhetoric school in Glacierport equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Ruby Bay. The number of metal casting academy in Snowveil equals the sum of the number of culinarian school in Shoreline City and the total number of schools in Ruby Bay. The number of global linguistics academy in Glacierport equals the sum of the number of culinarian school in Shoreline City and the total number of schools in Ruby Bay. The number of intergalactic diplomacy academy in Winterhaven equals the number of culinarian school in Shoreline City. The number of public highschool in Clearwater Bay equals 3. The number of academy of political philosophy in Glacierport equals the sum of the number of public highschool in Clearwater Bay and the total number of schools in Ruby Bay. The number of quantum computing academy in Frozen Hollow equals the difference between the number of public highschool in Clearwater Bay and the total number of schools in Ruby Bay. The number of event management conservatory in Frostford equals the number of public highschool in Clearwater Bay. The number of islamic calligraphy institute in Chillbrook equals the number of culinarian school in Shoreline City. The number of school of endangered species management in Icicle Hollow equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Shoreline City. The number of blockchain development academy in Frozen Hollow equals the sum of the number of public highschool in Clearwater Bay and the total number of schools in Ruby Bay. The number of school of scientific illustration in Frostford equals the number of public highschool in Clearwater Bay. The number of storytelling arts academy in Chillbrook equals the number of culinarian school in Shoreline City. The number of school of global economics in Coldspire equals the difference between the number of public highschool in Clearwater Bay and the number of culinarian school in Shoreline City. The number of school of equestrian arts in Winterhaven equals the difference between the total number of schools in Ruby Bay and the number of culinarian school in Shoreline City. The number of school of online media strategy in Snowveil equals the number of culinarian school in Ruby Bay. The number of nonprofit leadership school in Frostford equals the number of culinarian school in Shoreline City. The number of entrepreneurship development academy in Frostford equals the difference between the number of culinarian school in Ruby Bay and the number of culinarian school in Shoreline City. The number of material science research institute in Frostford equals the total number of schools in Ruby Bay. The number of school of ecosystem preservation in Icicle Hollow equals the difference between the number of culinarian school in Shoreline City and the total number of schools in Ruby Bay. The number of academy of holographic communication in Winterhaven equals the number of culinarian school in Ruby Bay. The number of creative writing conservatory in Glacierport equals the number of culinarian school in Ruby Bay. The number of civic engagement training institute in Frostford equals the sum of the number of culinarian school in Ruby Bay and the total number of schools in Ruby Bay. The number of speech therapy institute in Chillbrook equals the number of culinarian school in Ruby Bay. The number of school of ethical leadership in Frostford equals the number of culinarian school in Shoreline City. The number of ice skating conservatory in Winterhaven equals the sum of the number of culinarian school in Ruby Bay and the number of culinarian school in Shoreline City. The number of culinarian school in Ruby Bay equals 3. The number of supply chain and logistics institute in Coldspire equals the total number of schools in Ruby Bay. The number of culinarian school in Shoreline City equals the total number of schools in Ruby Bay. The number of quantum reality studies institute in Winterhaven equals the difference between the number of culinarian school in Ruby Bay and the total number of schools in Glacierport. The number of basketball leadership institute in Winterhaven equals the difference between the number of culinarian school in Shoreline City and the number of public highschool in Clearwater Bay. The number of augmented reality training institute in Snowveil equals the number of culinarian school in Shoreline City. The number of applied ethics institute in Glacierport equals the number of public highschool in Clearwater Bay. The number of robotics school in Coldspire equals the number of culinarian school in Ruby Bay. The number of school of user experience design in Icicle Hollow equals the total number of schools in Ruby Bay. The number of astrophysics research academy in Frostford equals the number of public highschool in Clearwater Bay. The number of school of pagan rites in Chillbrook equals the sum of the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. The number of global trade and policy academy in Frostford equals the number of public highschool in Clearwater Bay. The number of digital animation school in Coldspire equals the difference between the number of culinarian school in Shoreline City and the number of public highschool in Clearwater Bay. The number of school of environmental chemistry in Frostford equals the number of culinarian school in Ruby Bay. The number of school of investment strategies in Coldspire equals the number of culinarian school in Shoreline City. The number of cryogenics research institute in Winterhaven equals the difference between the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. The number of space colonization academy in Winterhaven equals the sum of the number of culinarian school in Shoreline City and the number of public highschool in Clearwater Bay. The number of school of stained glass art in Snowveil equals the sum of the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. The number of school of toy design in Snowveil equals the difference between the total number of schools in Ruby Bay and the total number of schools in Icicle Hollow. The number of wildlife tracking academy in Icicle Hollow equals the difference between the total number of schools in Ruby Bay and the number of public highschool in Clearwater Bay. The number of quantum physics academy in Coldspire equals the sum of the number of culinarian school in Ruby Bay and the number of public highschool in Clearwater Bay. ", "question": "How many culinarian school does Shoreline City have?", "solution": "Define culinarian school in Ruby Bay as i; so i = 3. Define total number of schools in Ruby Bay as P; so P = i = 3. Define culinarian school in Shoreline City as U; so U = P = 3. Answer: 3.", "op": 3, "id": 12, "template": "teachers_in_school", "mode": "normalforward", "length": "8k", "d": 2}
{"problem": "The number of intense detective thriller in Cinéma de Montreval equals the total number of movies in Festival de Saint-Rivage. The number of coded message post-apocalyptic drama in Raggi d'Ombra Festival equals the sum of the total number of movies in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about unraveling the murder within a time loop in Festival della Luce di Roma equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Festival de Saint-Rivage. The number of film about estranged siblings' mind games in Festival della Luce di Roma equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of kaleidoscopic memory retrieval thriller in Cinema Paradiso delle Stelle equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Festival de Saint-Rivage. The number of film about spoken-word monologue experimental tale in Cinema Paradiso delle Stelle equals the difference between the number of futuristic sci-fi movie in Rêves de Belleville and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about silent cityscape coming-of-age tale in Festival della Luce di Roma equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about first-person perspective time travel tale in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Cinéma de Montreval. The number of moonlit ballroom ghost drama in Festival della Luce di Roma equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about looping dreamscape narrative in Raggi d'Ombra Festival equals the number of intense detective thriller in Cinéma de Montreval. The number of film about double life unraveling in suburbia in Festival della Luce di Roma equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about silent jungle explorer mystery in Festival della Luce di Roma equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about silent pact of suburban neighbors in Festival della Luce di Roma equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of silent film with only ambient sounds in Raggi d'Ombra Festival equals the difference between the total number of movies in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about glitch art dystopian romance in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of digital twin identity swap thriller in Raggi d'Ombra Festival equals the number of intense detective thriller in Cinéma de Montreval. The number of film about corporate hacking espionage war in Raggi d'Ombra Festival equals the number of intense detective thriller in Cinéma de Montreval. The number of silent film with only ambient sounds in Cinema Paradiso delle Stelle equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of film about dream-interrogation gone awry in Festival della Luce di Roma equals the sum of the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of film about ghost ship's forgotten passengers in Festa del Cinema Sereno equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of film about reverse chronological ghost story in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about golem maker's tragedy in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about steamship adventure love story in Festival della Luce di Roma equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of fairy tale noir detective drama in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about collage of overlapping realities in Cinema Paradiso delle Stelle equals the difference between the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Festival de Saint-Rivage. The number of film about vr gaming tournament murder mystery in Raggi d'Ombra Festival equals the number of intense detective thriller in Cinéma de Montreval. The number of film about gothic vampire court intrigue in Cinema Paradiso delle Stelle equals the difference between the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Festival de Saint-Rivage. The number of film about train robbery western silent epic in Festival della Luce di Roma equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about one-act surrealist dinner party story in Cinema Paradiso delle Stelle equals the difference between the total number of movies in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about grieving parent caught in a hoax in Festival della Luce di Roma equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of 1920's political satire comedy in Festival della Luce di Roma equals the number of intense detective thriller in Festival de Saint-Rivage. The number of stop-motion apocalypse art film in Cinema Paradiso delle Stelle equals the difference between the number of intense detective thriller in Cinéma de Montreval and the number of intense detective thriller in Festival de Saint-Rivage. The number of intense detective thriller in Festival de Saint-Rivage equals 3. The number of film about 20's slapstick treasure hunt in Festival della Luce di Roma equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the number of intense detective thriller in Cinéma de Montreval. The number of film about abstract black-and-white exploration of loss in Raggi d'Ombra Festival equals the number of intense detective thriller in Cinéma de Montreval. The number of film about ancient artifact adventure mystery in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of film about dystopian biometric control rebellion in Raggi d'Ombra Festival equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Cinema Paradiso delle Stelle. The number of film about cursed forest horror fantasy in Cinema Paradiso delle Stelle equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Festival della Luce di Roma. The number of film about soul-bound warrior vengeance story in Cinema Paradiso delle Stelle equals the sum of the number of intense detective thriller in Cinéma de Montreval and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about shadowy programmer revenge tale in Raggi d'Ombra Festival equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about cybernetic detective solving a haunting in Trame di Siena Festival equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Lanterne di Venezia. The number of film about rotating pov character experiment in Cinema Paradiso delle Stelle equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about writer trapped in their own story in Festival della Luce di Roma equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Festival de Saint-Rivage. The number of film about hyper-network collapse survival saga in Raggi d'Ombra Festival equals the sum of the number of intense detective thriller in Cinéma de Montreval and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about jazz-age flapper revenge saga in Festival della Luce di Roma equals the total number of movies in Festival de Saint-Rivage. The number of 20's silent boxing drama in Festival della Luce di Roma equals the difference between the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Festival de Saint-Rivage. The number of film about abstract black-and-white exploration of loss in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Cinéma de Montreval. The number of film about silent romantic heist caper in Festival della Luce di Roma equals the difference between the number of futuristic sci-fi movie in Rêves de Belleville and the number of intense detective thriller in Cinéma de Montreval. The number of prison psychologist and inmate thriller in Festival della Luce di Roma equals the difference between the number of intense detective thriller in Cinéma de Montreval and the total number of movies in Festival de Saint-Rivage. The number of film about disjointed surreal time capsule narrative in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about small-town cult psychological maze in Festival della Luce di Roma equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Festival de Saint-Rivage. The number of film about data-mining whistleblower mystery in Raggi d'Ombra Festival equals the difference between the number of intense detective thriller in Cinéma de Montreval and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about silent masked vigilante noir in Festival della Luce di Roma equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about dragon hunter revenge saga in Cinema Paradiso delle Stelle equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of elemental wizard rivalry drama in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of film about cloud city romance adventure in Cinema Paradiso delle Stelle equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of simulated reality escape thriller in Raggi d'Ombra Festival equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about deep-sea diver's fragmented memory in Festival della Luce di Roma equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about minimalist desert survival story in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of film about neural implant hacker tragedy in Raggi d'Ombra Festival equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about sleep study turned mind-control experiment in Festival della Luce di Roma equals the sum of the number of intense detective thriller in Cinéma de Montreval and the number of intense detective thriller in Festival de Saint-Rivage. The number of gaslighting inheritance drama in Festival della Luce di Roma equals the sum of the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of film about single-shot nocturnal urban journey in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about lost love in a rainy city in Lanterne di Venezia equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the total number of movies in Raggi d'Ombra Festival. The number of film about cabaret dancer murder mystery in Festival della Luce di Roma equals the number of intense detective thriller in Festival de Saint-Rivage. The number of cybernetic augmented resistance thriller in Raggi d'Ombra Festival equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about time-looping wizard saga in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Cinéma de Montreval. The number of dreamscape travel thriller in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of film about hacktivist uncovering ancient secrets in Raggi d'Ombra Festival equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of 1920's inventor rivalry comedy in Festival della Luce di Roma equals the total number of movies in Festival de Saint-Rivage. The number of film about mythical beast gladiator tournament in Cinema Paradiso delle Stelle equals the difference between the number of intense detective thriller in Cinéma de Montreval and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about false memory murder accusation in Festival della Luce di Roma equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of social media influencer stalker thriller in Raggi d'Ombra Festival equals the total number of movies in Festival de Saint-Rivage. The number of film about crystal castle explorer's journey in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about dark web revenge heist in Raggi d'Ombra Festival equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about underwater merfolk rebellion in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of ai-prophet rebellion drama in Raggi d'Ombra Festival equals the number of intense detective thriller in Cinéma de Montreval. The number of film about chess prodigy playing against reality in Festival della Luce di Roma equals the difference between the number of intense detective thriller in Cinéma de Montreval and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about 12-hour real-time meditative cityscape in Cinema Paradiso delle Stelle equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of silent magical realism drama in Festival della Luce di Roma equals the number of intense detective thriller in Cinéma de Montreval. The number of film about rogue ai uprising epic in Raggi d'Ombra Festival equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about phoenix kingdom civil war in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of film about fractured dual-timeline romance in Cinema Paradiso delle Stelle equals the number of futuristic sci-fi movie in Rêves de Belleville. The number of shattered mirror heist drama in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Cinéma de Montreval. The number of clairvoyant's unraveling perception thriller in Festival della Luce di Roma equals the total number of movies in Festival de Saint-Rivage. The number of vintage horror vampire film in Festival della Luce di Roma equals the difference between the number of intense detective thriller in Cinéma de Montreval and the total number of movies in Festival de Saint-Rivage. The number of film about isolated artist's descent into madness in Festival della Luce di Roma equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of film about quantum encryption cyber-chase in Raggi d'Ombra Festival equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of film about crowdsourced online conspiracy unraveling in Raggi d'Ombra Festival equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about 1920's parisian mime tragedy in Festival della Luce di Roma equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the number of intense detective thriller in Cinéma de Montreval. The number of film about hologram infiltrator spy saga in Raggi d'Ombra Festival equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Festival de Saint-Rivage. The number of film about self-reflective ai director's story in Cinema Paradiso delle Stelle equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Festival de Saint-Rivage. The number of vaudeville stage comedy drama in Festival della Luce di Roma equals the sum of the number of futuristic sci-fi movie in Rêves de Belleville and the number of intense detective thriller in Festival de Saint-Rivage. The number of virtual reality sabotage thriller in Raggi d'Ombra Festival equals the sum of the number of intense detective thriller in Cinéma de Montreval and the total number of movies in Festival de Saint-Rivage. The number of film about silent alien invasion sci-fi in Festival della Luce di Roma equals the sum of the number of intense detective thriller in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of silent detective chase thriller in Festival della Luce di Roma equals the sum of the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about steam-powered kingdom heist in Cinema Paradiso delle Stelle equals the sum of the number of intense detective thriller in Cinéma de Montreval and the total number of movies in Festival de Saint-Rivage. The number of film about lost island tribal epic in Cinema Paradiso delle Stelle equals the difference between the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Festival de Saint-Rivage. The number of film about virtual assistant exposing dark secrets in Festival della Luce di Roma equals the sum of the total number of movies in Festival de Saint-Rivage and the number of futuristic sci-fi movie in Rêves de Belleville. The number of film about museum heist with identity crisis in Festival della Luce di Roma equals the sum of the total number of movies in Festival de Saint-Rivage and the number of intense detective thriller in Cinéma de Montreval. The number of elf kingdom political drama in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Festival de Saint-Rivage. The number of film about high-stakes courtroom manipulation in Festival della Luce di Roma equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Festival de Saint-Rivage. The number of film about silent circus tragedy romance in Festival della Luce di Roma equals the number of intense detective thriller in Cinéma de Montreval. The number of film about looping dreamscape narrative in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of film about fae versus human love story in Cinema Paradiso delle Stelle equals the total number of movies in Festival de Saint-Rivage. The number of magic school survival thriller in Cinema Paradiso delle Stelle equals the number of intense detective thriller in Cinéma de Montreval. The number of film about slow-motion underwater ballet narrative in Cinema Paradiso delle Stelle equals the difference between the number of intense detective thriller in Festival de Saint-Rivage and the total number of movies in Festival de Saint-Rivage. The number of film about corporate mind-meld conspiracy in Festival della Luce di Roma equals the number of intense detective thriller in Festival de Saint-Rivage. The number of futuristic sci-fi movie in Rêves de Belleville equals 3. ", "question": "How many intense detective thriller does Cinéma de Montreval have?", "solution": "Define intense detective thriller in Festival de Saint-Rivage as i; so i = 3. Define total number of movies in Festival de Saint-Rivage as P; so P = i = 3. Define intense detective thriller in Cinéma de Montreval as U; so U = P = 3. Answer: 3.", "op": 3, "id": 5, "template": "movie_festival_awards", "mode": "normalforward", "length": "8k", "d": 2}
{"problem": "The number of adult polar bear in Indian Ocean equals the difference between the number of adult racoon in Jefferson Circus and the number of adult racoon in South Zoo. The number of adult lilac-breasted roller in Pacific Ocean equals the number of adult racoon in South Zoo. The number of adult macaroni penguin in Atlantic Ocean equals the number of adult racoon in Jefferson Circus. The number of adult king penguin in Southern Ocean equals the number of adult racoon in South Zoo. The number of adult sun conure in Pacific Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult racoon in Jefferson Circus. The number of adult rockhopper penguin in Atlantic Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult racoon in South Zoo. The number of adult puffin in Atlantic Ocean equals the number of adult bear in Jefferson Circus. The number of adult northern cardinal in Pacific Ocean equals the number of adult racoon in South Zoo. The number of adult horseshoe crab in Indian Ocean equals the number of adult racoon in Bundle Ranch. The number of adult jaguar in Arctic Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult fennec fox in Sargasso Sea equals the sum of the number of adult racoon in South Zoo and the total number of adult animals in Coral Sea. The number of adult fiddler crab in Indian Ocean equals the number of adult bear in Bundle Ranch. The number of adult minotaur in Pacific Ocean equals the sum of the number of adult racoon in South Zoo and the number of adult racoon in Bundle Ranch. The number of adult coconut crab in Indian Ocean equals the number of adult racoon in Jefferson Circus. The number of adult beluga whale in Indian Ocean equals the number of adult bear in Jefferson Circus. The number of adult king eider in Indian Ocean equals the number of adult bear in Jefferson Circus. The number of adult basilisk in Pacific Ocean equals the difference between the number of adult racoon in South Zoo and the number of adult racoon in Bundle Ranch. The number of adult bear in Jefferson Circus equals the number of adult racoon in Jefferson Circus. The number of adult chinstrap penguin in Atlantic Ocean equals the number of adult racoon in Bundle Ranch. The number of adult arctic wolf in Indian Ocean equals the number of adult racoon in South Zoo. The number of adult ivory gull in Atlantic Ocean equals the sum of the number of adult bear in Bundle Ranch and the total number of adult animals in South Zoo. The number of adult chimera in Pacific Ocean equals the number of adult racoon in Jefferson Circus. The number of adult rock lobster in Indian Ocean equals the total number of adult animals in South Zoo. The number of adult toucan in Pacific Ocean equals the sum of the number of adult racoon in Jefferson Circus and the number of adult racoon in South Zoo. The number of adult greenland shark in Atlantic Ocean equals the total number of adult animals in South Zoo. The number of adult crab in Indian Ocean equals the total number of adult animals in South Zoo. The number of adult musk ox in Atlantic Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult fiordland penguin in Atlantic Ocean equals the number of adult racoon in Bundle Ranch. The number of adult royal penguin in Atlantic Ocean equals the total number of adult animals in South Zoo. The number of adult leopard seal in Atlantic Ocean equals the total number of adult animals in South Zoo. The number of adult unicorn in Pacific Ocean equals the number of adult racoon in South Zoo. The number of adult red bishop in Pacific Ocean equals the number of adult racoon in Jefferson Circus. The number of adult tiger prawn in Indian Ocean equals the difference between the number of adult racoon in Bundle Ranch and the total number of adult animals in Arctic Ocean. The number of adult bowhead whale in Indian Ocean equals the total number of adult animals in South Zoo. The number of adult ivory gull in Indian Ocean equals the sum of the number of adult bear in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult narwhal in Indian Ocean equals the total number of adult animals in South Zoo. The number of adult king crab in Indian Ocean equals the sum of the number of adult racoon in South Zoo and the total number of adult animals in South Zoo. The number of adult african penguin in Atlantic Ocean equals the number of adult racoon in Jefferson Circus. The number of adult emperor penguin in Atlantic Ocean equals the number of adult bear in Bundle Ranch. The number of adult peacock in Pacific Ocean equals the total number of adult animals in South Zoo. The number of adult manticore in Pacific Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult racoon in Bundle Ranch. The number of adult phoenix in Pacific Ocean equals the number of adult bear in Bundle Ranch. The number of adult bowhead whale in Atlantic Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult bear in Jefferson Circus. The number of adult arctic fox in Indian Ocean equals the difference between the number of adult bear in Bundle Ranch and the total number of adult animals in Southern Ocean. The number of adult mandarin duck in Pacific Ocean equals the number of adult racoon in South Zoo. The number of adult gouldian finch in Pacific Ocean equals the number of adult racoon in Bundle Ranch. The number of adult dungeness crab in Indian Ocean equals the number of adult bear in Jefferson Circus. The number of adult subantarctic penguin in Atlantic Ocean equals the difference between the number of adult bear in Bundle Ranch and the total number of adult animals in South Zoo. The number of adult blue hawk in Pacific Ocean equals the total number of adult animals in South Zoo. The number of adult nemean lion in Pacific Ocean equals the difference between the number of adult bear in Bundle Ranch and the number of adult racoon in Bundle Ranch. The number of adult flamingo in Pacific Ocean equals the total number of adult animals in South Zoo. The number of adult quetzal in Pacific Ocean equals the number of adult racoon in Bundle Ranch. The number of adult beluga whale in Atlantic Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult racoon in Bundle Ranch. The number of adult adélie penguin in Southern Ocean equals the difference between the number of adult bear in Bundle Ranch and the total number of adult animals in South Zoo. The number of adult emperor penguin in Southern Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult baltimore oriole in Pacific Ocean equals the difference between the number of adult racoon in South Zoo and the number of adult bear in Jefferson Circus. The number of adult shrimp in Indian Ocean equals the number of adult racoon in South Zoo. The number of adult humboldt penguin in Atlantic Ocean equals the number of adult bear in Bundle Ranch. The number of adult arctic hare in Indian Ocean equals the number of adult bear in Bundle Ranch. The number of adult caribou in Indian Ocean equals the number of adult racoon in South Zoo. The number of adult griffin in Pacific Ocean equals the difference between the number of adult bear in Bundle Ranch and the number of adult bear in Jefferson Circus. The number of adult king penguin in Atlantic Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult racoon in South Zoo. The number of adult musk ox in Indian Ocean equals the sum of the number of adult racoon in Bundle Ranch and the total number of adult animals in South Zoo. The number of adult polar bear in Atlantic Ocean equals the sum of the number of adult racoon in Jefferson Circus and the number of adult racoon in Bundle Ranch. The number of adult ross's gull in Indian Ocean equals the difference between the number of adult racoon in South Zoo and the total number of adult animals in Pacific Ocean. The number of adult walrus in Indian Ocean equals the number of adult bear in Jefferson Circus. The number of adult snow crab in Indian Ocean equals the number of adult bear in Bundle Ranch. The number of adult fairy penguin in Atlantic Ocean equals the number of adult bear in Bundle Ranch. The number of adult snowy owl in Atlantic Ocean equals the number of adult bear in Bundle Ranch. The number of adult kingfisher in Pacific Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult racoon in South Zoo. The number of adult scarlet macaw in Pacific Ocean equals the total number of adult animals in South Zoo. The number of adult puffin in Indian Ocean equals the number of adult bear in Bundle Ranch. The number of adult lobster in Indian Ocean equals the sum of the number of adult racoon in Bundle Ranch and the number of adult bear in Bundle Ranch. The number of adult arctic tern in Indian Ocean equals the total number of adult animals in South Zoo. The number of adult fenrir in Pacific Ocean equals the sum of the number of adult bear in Jefferson Circus and the number of adult racoon in Jefferson Circus. The number of adult harp seal in Atlantic Ocean equals the sum of the number of adult bear in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult leopard seal in Indian Ocean equals the sum of the number of adult bear in Jefferson Circus and the number of adult racoon in Jefferson Circus. The number of adult barnacle in Indian Ocean equals the number of adult racoon in South Zoo. The number of adult harp seal in Indian Ocean equals the number of adult racoon in Bundle Ranch. The number of adult arctic wolf in Atlantic Ocean equals the number of adult bear in Bundle Ranch. The number of adult ross's gull in Atlantic Ocean equals the difference between the number of adult bear in Jefferson Circus and the number of adult racoon in Jefferson Circus. The number of adult arctic fox in Atlantic Ocean equals the number of adult racoon in Bundle Ranch. The number of adult paradise tanager in Pacific Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult bear in Jefferson Circus. The number of adult adélie penguin in Atlantic Ocean equals the sum of the number of adult racoon in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult narwhal in Atlantic Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult bear in Bundle Ranch. The number of adult kraken in Pacific Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult bear in Bundle Ranch. The number of adult king eider in Atlantic Ocean equals the number of adult racoon in Jefferson Circus. The number of adult caribou in Atlantic Ocean equals the number of adult racoon in South Zoo. The number of adult greenland shark in Indian Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult racoon in Bundle Ranch. The number of adult langoustine in Indian Ocean equals the number of adult racoon in Jefferson Circus. The number of adult green-winged macaw in Pacific Ocean equals the number of adult racoon in Jefferson Circus. The number of adult racoon in Jefferson Circus equals 4. The number of adult white-flippered penguin in Atlantic Ocean equals the number of adult racoon in Jefferson Circus. The number of adult spider crab in Indian Ocean equals the sum of the number of adult racoon in Jefferson Circus and the number of adult racoon in Bundle Ranch. The number of adult centaur in Pacific Ocean equals the sum of the number of adult racoon in South Zoo and the total number of adult animals in South Zoo. The number of adult victoria crowned pigeon in Pacific Ocean equals the number of adult racoon in Jefferson Circus. The number of adult jaguar in Coral Sea equals the sum of the number of adult racoon in Bundle Ranch and the total number of adult animals in Indian Ocean. The number of adult dragon in Pacific Ocean equals the sum of the number of adult racoon in Jefferson Circus and the total number of adult animals in South Zoo. The number of adult mantis shrimp in Indian Ocean equals the total number of adult animals in South Zoo. The number of adult little blue penguin in Atlantic Ocean equals the number of adult bear in Jefferson Circus. The number of adult galápagos penguin in Atlantic Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult racoon in South Zoo. The number of adult leviathan in Pacific Ocean equals the sum of the number of adult racoon in South Zoo and the total number of adult animals in Atlantic Ocean. The number of adult hydra in Pacific Ocean equals the sum of the number of adult bear in Jefferson Circus and the number of adult racoon in Jefferson Circus. The number of adult ghost crab in Indian Ocean equals the difference between the number of adult bear in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult cerberus in Pacific Ocean equals the sum of the number of adult racoon in Bundle Ranch and the number of adult bear in Bundle Ranch. The number of adult racoon in Bundle Ranch equals 3 plus the difference between the total number of adult animals in South Zoo and the number of adult bear in Bundle Ranch. The number of adult yellow-eyed penguin in Atlantic Ocean equals the number of adult racoon in Bundle Ranch. The number of adult kitsune in Pacific Ocean equals the number of adult bear in Bundle Ranch. The number of adult blue crab in Indian Ocean equals the number of adult racoon in Bundle Ranch. The number of adult walrus in Atlantic Ocean equals the number of adult racoon in South Zoo. The number of adult krill in Indian Ocean equals the number of adult racoon in Jefferson Circus. The number of adult pegasus in Pacific Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult bear in Bundle Ranch. The number of adult selkie in Pacific Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult racoon in South Zoo. The number of adult gentoo penguin in Atlantic Ocean equals the number of adult racoon in South Zoo. The number of adult racoon in South Zoo exists, and its number is greater than 0. The number of adult snowy owl in Indian Ocean equals the number of adult racoon in Jefferson Circus. The number of adult hippogriff in Pacific Ocean equals the number of adult bear in Jefferson Circus. The number of adult rainbow lorikeet in Pacific Ocean equals the difference between the number of adult bear in Bundle Ranch and the number of adult bear in Jefferson Circus. The number of adult bear in Bundle Ranch equals 3. The number of adult erect-crested penguin in Atlantic Ocean equals the number of adult bear in Bundle Ranch. The number of adult collared lemming in Atlantic Ocean equals the difference between the number of adult racoon in South Zoo and the number of adult bear in Jefferson Circus. The number of adult snares penguin in Atlantic Ocean equals the difference between the total number of adult animals in South Zoo and the number of adult bear in Jefferson Circus. The number of adult arctic tern in Atlantic Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult racoon in Bundle Ranch. The number of adult golden pheasant in Pacific Ocean equals the sum of the total number of adult animals in South Zoo and the number of adult bear in Bundle Ranch. The number of adult painted bunting in Pacific Ocean equals the difference between the number of adult racoon in South Zoo and the number of adult bear in Jefferson Circus. The number of adult magellanic penguin in Atlantic Ocean equals the sum of the number of adult racoon in Bundle Ranch and the total number of adult animals in South Zoo. The number of adult pistol shrimp in Indian Ocean equals the difference between the number of adult racoon in South Zoo and the number of adult bear in Jefferson Circus. The number of adult bear in Bundle Ranch equals the total number of adult animals in South Zoo. The number of adult hermit crab in Indian Ocean equals the number of adult racoon in Bundle Ranch. The number of adult roc in Pacific Ocean equals the number of adult bear in Bundle Ranch. The number of adult collared lemming in Indian Ocean equals the difference between the number of adult racoon in Bundle Ranch and the number of adult racoon in Jefferson Circus. The number of adult arctic hare in Atlantic Ocean equals the number of adult bear in Jefferson Circus. ", "question": "How many adult racoon does South Zoo have?", "solution": "The question is difficult, so we use equations to solve it. Define adult racoon in South Zoo as x; we don't know its value yet but will find it out later. Define total number of adult animals in South Zoo as T; so T = x = x. Define adult bear in Bundle Ranch as J; so J = T = x. We know J = 3, so we have x = 3 and we solve it through the following steps: Simplifying the equation: x = 3. Move all terms to one side: x - 3 = 0. Isolate the term with x: 1*x = 3. Divide both sides by 1: x = 3 / 1. Solution: x = 3. Answer: 3.", "op": 3, "id": 8, "template": "crazy_zootopia", "mode": "forwardreverse", "length": "8k", "d": 2}
{"problem": "The number of adult fennec fox in Moonshadow Palace equals the number of adult eagle in Jefferson Circus. The number of adult blue-legged mantella in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult red-eyed tree frog in Duskspire Ruins equals the number of adult crow in Hamilton Farm. The number of adult sea urchin in Gleamreef Throne equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Bundle Ranch. The number of adult harlequin shrimp in Gleamreef Throne equals the difference between the number of adult crow in Bundle Ranch and the total number of adult animals in Shimmerstone Hall. The number of adult crowned tree frog in Abyssal Citadel equals the number of adult eagle in Jefferson Circus. The number of adult blue poison dart frog in Abyssal Citadel equals the sum of the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult coyote in Moonshadow Palace equals the difference between the number of adult crow in Hamilton Farm and the number of adult eagle in Jefferson Circus. The number of adult tree kangaroo in Gleamreef Throne equals the difference between the number of adult crow in Hamilton Farm and the number of adult crow in Bundle Ranch. The number of adult poison dart frog in Abyssal Citadel equals the difference between the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult vole in Moonshadow Palace equals the number of adult eagle in Jefferson Circus. The number of adult sea cucumber in Gleamreef Throne equals the difference between the number of adult crow in Hamilton Farm and the total number of adult animals in Bundle Ranch. The number of adult groundhog in Moonshadow Palace equals the number of adult crow in Bundle Ranch. The number of adult manta ray in Gleamreef Throne equals the sum of the number of adult eagle in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult amphipod in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult poison dart frog in Duskspire Ruins equals the number of adult blue jay in Jefferson Circus. The number of adult cyanobacteria in Abyssal Citadel equals the number of adult crow in Bundle Ranch. The number of adult parrotfish in Gleamreef Throne equals the sum of the number of adult blue jay in Jefferson Circus and the total number of adult animals in Moonshadow Palace. The number of adult phytoplankton in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult sea anemone in Gleamreef Throne equals the sum of the total number of adult animals in Bundle Ranch and the number of adult crow in Bundle Ranch. The number of adult starfish in Gleamreef Throne equals the number of adult crow in Bundle Ranch. The number of adult tiger salamander in Duskspire Ruins equals the number of adult blue jay in Jefferson Circus. The number of adult opossum in Gleamreef Throne equals the difference between the number of adult crow in Hamilton Farm and the number of adult eagle in Jefferson Circus. The number of adult butterflyfish in Gleamreef Throne equals the difference between the total number of adult animals in Bundle Ranch and the number of adult crow in Bundle Ranch. The number of adult foraminifera in Abyssal Citadel equals the number of adult crow in Hamilton Farm. The number of adult hamster in Moonshadow Palace equals the number of adult eagle in Jefferson Circus. The number of adult strawberry poison dart frog in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult golden mantella in Abyssal Citadel equals the sum of the number of adult crow in Hamilton Farm and the number of adult eagle in Jefferson Circus. The number of adult diatom in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult red-eyed tree frog in Abyssal Citadel equals the difference between the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult wallaby in Gleamreef Throne equals the difference between the total number of adult animals in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult dinoflagellate in Abyssal Citadel equals the number of adult crow in Bundle Ranch. The number of adult euphausiid in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult larvacean in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult agouti in Moonshadow Palace equals the sum of the number of adult crow in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult tintinnid in Abyssal Citadel equals the number of adult eagle in Jefferson Circus. The number of adult dromedary camel in Moonshadow Palace equals the difference between the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult damselfish in Gleamreef Throne equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Bundle Ranch. The number of adult desert locust in Moonshadow Palace equals the number of adult crow in Bundle Ranch. The number of adult pteropod in Abyssal Citadel equals the difference between the total number of adult animals in Bundle Ranch and the number of adult crow in Hamilton Farm. The number of adult jaguar in Shimmerstone Hall equals the sum of the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult lehmann's poison frog in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult rat in Moonshadow Palace equals the number of adult blue jay in Jefferson Circus. The number of adult moray eel in Gleamreef Throne equals the sum of the total number of adult animals in Bundle Ranch and the number of adult crow in Bundle Ranch. The number of adult brush-tailed possum in Gleamreef Throne equals the sum of the number of adult crow in Bundle Ranch and the total number of adult animals in Bundle Ranch. The number of adult bilby in Gleamreef Throne equals the number of adult crow in Bundle Ranch. The number of adult kokoe poison frog in Abyssal Citadel equals the number of adult eagle in Jefferson Circus. The number of adult mole in Moonshadow Palace equals the number of adult crow in Hamilton Farm. The number of adult paca in Moonshadow Palace equals the sum of the number of adult blue jay in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult chaetognath in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult chinchilla in Moonshadow Palace equals the number of adult eagle in Jefferson Circus. The number of adult sand cat in Moonshadow Palace equals the total number of adult animals in Bundle Ranch. The number of adult shiba inu in Luminous Keep equals the sum of the number of adult blue jay in Jefferson Circus and the number of adult crow in Bundle Ranch. The number of adult waxy monkey frog in Abyssal Citadel equals the number of adult crow in Bundle Ranch. The number of adult spiny lobster in Gleamreef Throne equals the sum of the total number of adult animals in Bundle Ranch and the number of adult eagle in Jefferson Circus. The number of adult noctiluca in Abyssal Citadel equals the number of adult crow in Bundle Ranch. The number of adult acantharian in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult mouse in Moonshadow Palace equals the number of adult eagle in Jefferson Circus. The number of adult thylacine in Gleamreef Throne equals the difference between the total number of adult animals in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult oryx in Moonshadow Palace equals the difference between the number of adult eagle in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult crow in Bundle Ranch exists, and its number is greater than 0. The number of adult addax in Moonshadow Palace equals the difference between the number of adult blue jay in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult copepod in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult green and black poison frog in Abyssal Citadel equals the sum of the total number of adult animals in Bundle Ranch and the number of adult crow in Bundle Ranch. The number of adult eastern quoll in Gleamreef Throne equals the difference between the number of adult eagle in Jefferson Circus and the number of adult blue jay in Jefferson Circus. The number of adult glass frog in Abyssal Citadel equals the number of adult eagle in Jefferson Circus. The number of adult capybara in Moonshadow Palace equals the total number of adult animals in Bundle Ranch. The number of adult salp in Abyssal Citadel equals the difference between the total number of adult animals in Bundle Ranch and the number of adult eagle in Jefferson Circus. The number of adult thaliacean in Abyssal Citadel equals the number of adult eagle in Jefferson Circus. The number of adult kangaroo in Gleamreef Throne equals the difference between the number of adult eagle in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult quokka in Gleamreef Throne equals the difference between the number of adult crow in Bundle Ranch and the number of adult crow in Hamilton Farm. The number of adult wombat in Gleamreef Throne equals the sum of the number of adult eagle in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult meerkat in Moonshadow Palace equals the number of adult eagle in Jefferson Circus. The number of adult long-nosed bandicoot in Gleamreef Throne equals the difference between the total number of adult animals in Bundle Ranch and the number of adult crow in Bundle Ranch. The number of adult gobies in Gleamreef Throne equals the sum of the number of adult eagle in Jefferson Circus and the number of adult blue jay in Jefferson Circus. The number of adult amazon milk frog in Abyssal Citadel equals the sum of the number of adult eagle in Jefferson Circus and the number of adult crow in Bundle Ranch. The number of adult beaver in Moonshadow Palace equals the difference between the total number of adult animals in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult bettong in Gleamreef Throne equals the sum of the number of adult eagle in Jefferson Circus and the total number of adult animals in Luminous Keep. The number of adult roadrunner in Moonshadow Palace equals the sum of the number of adult eagle in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult desert hedgehog in Moonshadow Palace equals the sum of the total number of adult animals in Bundle Ranch and the total number of adult animals in Abyssal Citadel. The number of adult gopher in Moonshadow Palace equals the number of adult crow in Bundle Ranch. The number of adult axolotl in Duskspire Ruins equals the number of adult crow in Bundle Ranch. The number of adult desert tortoise in Moonshadow Palace equals the number of adult crow in Bundle Ranch. The number of adult scorpion in Moonshadow Palace equals the number of adult crow in Bundle Ranch. The number of adult squirrel in Moonshadow Palace equals the sum of the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult thorny devil in Moonshadow Palace equals the number of adult blue jay in Jefferson Circus. The number of adult eagle in Jefferson Circus equals the sum of the number of adult blue jay in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult rock wallaby in Gleamreef Throne equals the difference between the number of adult crow in Bundle Ranch and the total number of adult animals in Crystal Abyss. The number of adult rotifer in Abyssal Citadel equals the difference between the number of adult crow in Bundle Ranch and the number of adult crow in Hamilton Farm. The number of adult cladoceran in Abyssal Citadel equals the difference between the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult sugar glider in Gleamreef Throne equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Bundle Ranch. The number of adult guinea pig in Moonshadow Palace equals the sum of the number of adult crow in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult dormouse in Moonshadow Palace equals the number of adult crow in Hamilton Farm. The number of adult numbat in Gleamreef Throne equals the total number of adult animals in Bundle Ranch. The number of adult kangaroo rat in Moonshadow Palace equals the difference between the total number of adult animals in Bundle Ranch and the number of adult crow in Hamilton Farm. The number of adult boxfish in Gleamreef Throne equals the sum of the number of adult eagle in Jefferson Circus and the number of adult crow in Bundle Ranch. The number of adult crow in Hamilton Farm equals 2. The number of adult lionfish in Gleamreef Throne equals the difference between the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult bullfrog in Duskspire Ruins equals the number of adult crow in Bundle Ranch. The number of adult pipefish in Gleamreef Throne equals the sum of the number of adult eagle in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult gila monster in Moonshadow Palace equals the sum of the number of adult crow in Hamilton Farm and the number of adult eagle in Jefferson Circus. The number of adult tomato frog in Abyssal Citadel equals the sum of the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult tiger-striped leaf frog in Abyssal Citadel equals the sum of the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult blue jay in Jefferson Circus equals 3. The number of adult nutria in Moonshadow Palace equals the difference between the number of adult crow in Hamilton Farm and the number of adult eagle in Jefferson Circus. The number of adult koala in Gleamreef Throne equals the difference between the number of adult blue jay in Jefferson Circus and the number of adult crow in Bundle Ranch. The number of adult camel in Moonshadow Palace equals the number of adult blue jay in Jefferson Circus. The number of adult cleaner shrimp in Gleamreef Throne equals the number of adult crow in Bundle Ranch. The number of adult bandicoot in Gleamreef Throne equals the sum of the total number of adult animals in Bundle Ranch and the number of adult crow in Hamilton Farm. The number of adult splendid leaf frog in Abyssal Citadel equals the number of adult eagle in Jefferson Circus. The number of adult tasmanian devil in Gleamreef Throne equals the sum of the total number of adult animals in Bundle Ranch and the total number of adult animals in Duskspire Ruins. The number of adult chipmunk in Moonshadow Palace equals the number of adult blue jay in Jefferson Circus. The number of adult triggerfish in Gleamreef Throne equals the sum of the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult radiolaria in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult marsupial mole in Gleamreef Throne equals the number of adult blue jay in Jefferson Circus. The number of adult hawkfish in Gleamreef Throne equals the number of adult crow in Bundle Ranch. The number of adult lemming in Moonshadow Palace equals the sum of the number of adult crow in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult clownfish in Gleamreef Throne equals the number of adult eagle in Jefferson Circus. The number of adult hourglass tree frog in Abyssal Citadel equals the number of adult blue jay in Jefferson Circus. The number of adult gerbil in Moonshadow Palace equals the sum of the number of adult blue jay in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult bumblebee poison dart frog in Abyssal Citadel equals the total number of adult animals in Bundle Ranch. The number of adult golden mole in Moonshadow Palace equals the number of adult blue jay in Jefferson Circus. The number of adult blue jay in Jefferson Circus equals the total number of adult animals in Bundle Ranch. The number of adult poison dart frog in Crystal Abyss equals the difference between the number of adult eagle in Jefferson Circus and the total number of adult animals in Bundle Ranch. The number of adult jerboa in Moonshadow Palace equals the number of adult crow in Bundle Ranch. The number of adult sea slug in Gleamreef Throne equals the sum of the number of adult crow in Hamilton Farm and the number of adult crow in Bundle Ranch. The number of adult horned lizard in Moonshadow Palace equals the difference between the number of adult eagle in Jefferson Circus and the number of adult crow in Hamilton Farm. The number of adult zooplankton in Abyssal Citadel equals the difference between the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult porcupine in Moonshadow Palace equals the number of adult crow in Hamilton Farm. The number of adult fire salamander in Duskspire Ruins equals the sum of the number of adult blue jay in Jefferson Circus and the number of adult eagle in Jefferson Circus. The number of adult sidewinder rattlesnake in Moonshadow Palace equals the difference between the number of adult crow in Bundle Ranch and the number of adult blue jay in Jefferson Circus. The number of adult harlequin poison frog in Abyssal Citadel equals the difference between the number of adult eagle in Jefferson Circus and the number of adult crow in Bundle Ranch. The number of adult potoroo in Gleamreef Throne equals the difference between the number of adult crow in Hamilton Farm and the number of adult blue jay in Jefferson Circus. The number of adult dyeing dart frog in Abyssal Citadel equals the number of adult crow in Hamilton Farm. ", "question": "How many adult crow does Bundle Ranch have?", "solution": "The question is difficult, so we use equations to solve it. Define adult crow in Bundle Ranch as x; we don't know its value yet but will find it out later. Define total number of adult animals in Bundle Ranch as g; so g = x = x. Define adult blue jay in Jefferson Circus as r; so r = g = x. We know r = 3, so we have x = 3 and we solve it through the following steps: Simplifying the equation: x = 3. Move all terms to one side: x - 3 = 0. Isolate the term with x: 1*x = 3. Divide both sides by 1: x = 3 / 1. Solution: x = 3. Answer: 3.", "op": 3, "id": 0, "template": "crazy_zootopia", "mode": "forwardreverse", "length": "8k", "d": 2}
{"problem": "The number of marine mammal research institute in Queensmeadow equals the sum of the number of culinarian school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of school of conservation biology in Queensmeadow equals the number of culinarian school in Riverton City. The number of academy of motion graphics in Colonial Hollow equals the total number of schools in Riverton City. The number of organic farming academy in Queensmeadow equals the number of elementary school in Clearwater Bay. The number of school of endangered species management in Kingsford equals the difference between the total number of schools in Riverton City and the number of culinarian school in Riverton City. The number of school of urban agriculture in Queensmeadow equals the number of culinarian school in Riverton City. The number of school of habitat studies in Kingsford equals the number of culinarian school in Riverton City. The number of culinarian school in Riverton City exists, and its number is greater than 0. The number of elementary school in Oakbridge City equals 3 plus the difference between the total number of schools in Riverton City and the number of culinarian school in Oakbridge City. The number of school of rocketry in Kingsford equals the number of elementary school in Clearwater Bay. The number of school of energy storage systems in Oldbridge equals the number of culinarian school in Clearwater Bay. The number of school of ocean preservation in Queensmeadow equals the total number of schools in Riverton City. The number of glassblowing conservatory in Oldbridge equals the sum of the total number of schools in Riverton City and the number of elementary school in Clearwater Bay. The number of school of forest ecology in Kingsford equals the total number of schools in Riverton City. The number of hydrology research academy in Queensmeadow equals the sum of the number of elementary school in Clearwater Bay and the number of elementary school in Oakbridge City. The number of school of user experience design in Colonial Hollow equals the difference between the number of elementary school in Oakbridge City and the number of culinarian school in Oakbridge City. The number of virtual reality development institute in Colonial Hollow equals the sum of the number of elementary school in Clearwater Bay and the number of culinarian school in Riverton City. The number of wildlife tracking academy in Kingsford equals the difference between the number of elementary school in Oakbridge City and the total number of schools in Riverton City. The number of culinarian school in Oakbridge City equals 3. The number of school of zero-g engineering in Kingsford equals the number of culinarian school in Riverton City. The number of drone navigation conservatory in Kingsford equals the number of culinarian school in Oakbridge City. The number of elementary school in Clearwater Bay equals 4. The number of puppetry arts conservatory in Colonial Hollow equals the sum of the number of culinarian school in Riverton City and the number of culinarian school in Clearwater Bay. The number of school of permaculture in Queensmeadow equals the number of culinarian school in Riverton City. The number of school of improvisation in Colonial Hollow equals the sum of the number of culinarian school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of school of habitat studies in Queensmeadow equals the difference between the number of culinarian school in Oakbridge City and the number of elementary school in Oakbridge City. The number of school of instrumental performance in Colonial Hollow equals the sum of the number of culinarian school in Riverton City and the number of culinarian school in Clearwater Bay. The number of astronaut training academy in Kingsford equals the number of elementary school in Clearwater Bay. The number of school of traditional weaving in Oldbridge equals the sum of the number of culinarian school in Clearwater Bay and the number of elementary school in Clearwater Bay. The number of applied ethics institute in Monarch's Hill equals the number of culinarian school in Oakbridge City. The number of space colonization academy in Heritagedale equals the number of culinarian school in Oakbridge City. The number of pilot's academy of excellence in Heritagedale equals the sum of the number of elementary school in Clearwater Bay and the total number of schools in Colonial Hollow. The number of aerodynamics research institute in Heritagedale equals the difference between the number of elementary school in Oakbridge City and the number of culinarian school in Oakbridge City. The number of school of conservation biology in Kingsford equals the number of culinarian school in Riverton City. The number of satellite communications academy in Kingsford equals the number of elementary school in Oakbridge City. The number of culinarian school in Oakbridge City equals the total number of schools in Riverton City. The number of air traffic control institute in Monarch's Hill equals the number of culinarian school in Riverton City. The number of cryogenics research institute in Heritagedale equals the number of culinarian school in Clearwater Bay. The number of avian studies academy in Kingsford equals the sum of the number of culinarian school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of digital storytelling academy in Colonial Hollow equals the difference between the number of culinarian school in Riverton City and the number of culinarian school in Clearwater Bay. The number of school of stage production in Colonial Hollow equals the sum of the total number of schools in Riverton City and the number of culinarian school in Riverton City. The number of augmented reality training institute in Colonial Hollow equals the difference between the total number of schools in Riverton City and the number of culinarian school in Clearwater Bay. The number of marine mammal research institute in Kingsford equals the number of culinarian school in Riverton City. The number of pilot's academy of excellence in Kingsford equals the difference between the number of culinarian school in Riverton City and the number of elementary school in Oakbridge City. The number of school of space medicine in Kingsford equals the number of culinarian school in Oakbridge City. The number of academy of holographic communication in Heritagedale equals the number of elementary school in Oakbridge City. The number of school of space medicine in Monarch's Hill equals the number of culinarian school in Riverton City. The number of wildlife tracking academy in Queensmeadow equals the number of elementary school in Clearwater Bay. The number of classical music conservatory in Colonial Hollow equals the total number of schools in Riverton City. The number of school of zero-g engineering in Heritagedale equals the sum of the number of elementary school in Clearwater Bay and the total number of schools in Riverton City. The number of school of contemporary dance in Colonial Hollow equals the number of culinarian school in Riverton City. The number of satellite communications academy in Heritagedale equals the number of culinarian school in Oakbridge City. The number of school of forest ecology in Queensmeadow equals the number of elementary school in Oakbridge City. The number of school of astrobiology in Monarch's Hill equals the difference between the number of elementary school in Clearwater Bay and the total number of schools in Heritagedale. The number of acting and theater academy in Colonial Hollow equals the sum of the total number of schools in Riverton City and the number of culinarian school in Riverton City. The number of opera studies institute in Colonial Hollow equals the number of elementary school in Clearwater Bay. The number of school of ecosystem preservation in Queensmeadow equals the number of culinarian school in Oakbridge City. The number of school of endangered species management in Queensmeadow equals the number of elementary school in Oakbridge City. The number of school of bookbinding in Oldbridge equals the sum of the number of culinarian school in Clearwater Bay and the number of elementary school in Clearwater Bay. The number of environmental ethics institute in Monarch's Hill equals the number of culinarian school in Riverton City. The number of school of artificial lifeforms in Heritagedale equals the sum of the number of elementary school in Clearwater Bay and the total number of schools in Queensmeadow. The number of school of rocketry in Heritagedale equals the number of culinarian school in Oakbridge City. The number of aerodynamics research institute in Kingsford equals the total number of schools in Riverton City. The number of basket weaving academy in Oldbridge equals the number of elementary school in Clearwater Bay. The number of school of bioethics in Monarch's Hill equals the number of culinarian school in Oakbridge City. The number of school of sustainable manufacturing in Oldbridge equals the difference between the number of elementary school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of carbon neutrality academy in Oldbridge equals the difference between the number of culinarian school in Riverton City and the number of culinarian school in Clearwater Bay. The number of school of nanobot engineering in Heritagedale equals the difference between the number of culinarian school in Oakbridge City and the total number of schools in Riverton City. The number of school of climate science in Queensmeadow equals the sum of the number of elementary school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of air traffic control institute in Heritagedale equals the total number of schools in Riverton City. The number of school of solar engineering in Oldbridge equals the difference between the total number of schools in Riverton City and the number of elementary school in Oakbridge City. The number of eastern philosophy conservatory in Monarch's Hill equals the number of elementary school in Oakbridge City. The number of renewable resources training institute in Queensmeadow equals the number of elementary school in Oakbridge City. The number of school of leathercraft in Oldbridge equals the number of culinarian school in Oakbridge City. The number of woodworking institute in Oldbridge equals the number of culinarian school in Clearwater Bay. The number of school of ecosystem preservation in Kingsford equals the difference between the total number of schools in Riverton City and the number of culinarian school in Clearwater Bay. The number of school of existential studies in Monarch's Hill equals the number of culinarian school in Riverton City. The number of school of geothermal energy in Oldbridge equals the difference between the number of elementary school in Oakbridge City and the total number of schools in Riverton City. The number of aerodynamics research institute in Monarch's Hill equals the difference between the number of elementary school in Clearwater Bay and the number of elementary school in Oakbridge City. The number of school of video game design in Colonial Hollow equals the number of elementary school in Clearwater Bay. The number of critical thinking and logic academy in Monarch's Hill equals the number of culinarian school in Riverton City. The number of ecological restoration institute in Kingsford equals the number of elementary school in Oakbridge City. The number of drone navigation conservatory in Heritagedale equals the difference between the number of elementary school in Oakbridge City and the number of culinarian school in Oakbridge City. The number of sustainable architecture academy in Queensmeadow equals the number of culinarian school in Oakbridge City. The number of school of renewable materials in Oldbridge equals the difference between the number of elementary school in Oakbridge City and the number of culinarian school in Riverton City. The number of jewelry design institute in Oldbridge equals the difference between the total number of schools in Riverton City and the number of culinarian school in Oakbridge City. The number of hydropower research institute in Oldbridge equals the difference between the number of culinarian school in Oakbridge City and the total number of schools in Riverton City. The number of metalworking arts academy in Oldbridge equals the sum of the number of elementary school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of school of astrobiology in Heritagedale equals the difference between the number of culinarian school in Clearwater Bay and the number of elementary school in Clearwater Bay. The number of academy of energy policy in Oldbridge equals the sum of the number of culinarian school in Riverton City and the total number of schools in Riverton City. The number of school of cloning ethics in Heritagedale equals the difference between the number of elementary school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of quantum reality studies institute in Heritagedale equals the number of elementary school in Oakbridge City. The number of school of rocketry in Monarch's Hill equals the number of culinarian school in Oakbridge City. The number of school of space medicine in Heritagedale equals the number of culinarian school in Clearwater Bay. The number of circus performance academy in Colonial Hollow equals the difference between the number of culinarian school in Oakbridge City and the total number of schools in Kingsford. The number of academy of stand-up comedy in Colonial Hollow equals the number of elementary school in Clearwater Bay. The number of pottery and ceramics academy in Oldbridge equals the number of culinarian school in Riverton City. The number of ecological restoration institute in Queensmeadow equals the sum of the number of elementary school in Oakbridge City and the number of elementary school in Clearwater Bay. The number of school of time travel theory in Heritagedale equals the number of culinarian school in Clearwater Bay. The number of pilot's academy of excellence in Monarch's Hill equals the sum of the number of culinarian school in Riverton City and the total number of schools in Riverton City. The number of satellite communications academy in Monarch's Hill equals the number of culinarian school in Oakbridge City. The number of school of coral reef studies in Queensmeadow equals the difference between the number of culinarian school in Clearwater Bay and the number of elementary school in Clearwater Bay. The number of astronaut training academy in Monarch's Hill equals the sum of the total number of schools in Riverton City and the total number of schools in Oldbridge. The number of academy of political philosophy in Monarch's Hill equals the difference between the number of culinarian school in Oakbridge City and the number of culinarian school in Clearwater Bay. The number of academy of rational thought in Monarch's Hill equals the number of elementary school in Oakbridge City. The number of school of astrobiology in Kingsford equals the total number of schools in Riverton City. The number of bioenergy research institute in Oldbridge equals the sum of the total number of schools in Riverton City and the number of culinarian school in Oakbridge City. The number of digital content creation school in Colonial Hollow equals the number of culinarian school in Clearwater Bay. The number of culinarian school in Clearwater Bay equals the number of elementary school in Clearwater Bay. The number of school of quiltmaking in Oldbridge equals the sum of the total number of schools in Riverton City and the number of elementary school in Oakbridge City. The number of avian studies academy in Queensmeadow equals the sum of the number of culinarian school in Riverton City and the number of elementary school in Oakbridge City. The number of interactive media conservatory in Colonial Hollow equals the difference between the total number of schools in Riverton City and the number of culinarian school in Oakbridge City. The number of school of online media strategy in Colonial Hollow equals the number of culinarian school in Clearwater Bay. The number of wildlife conservation school in Queensmeadow equals the total number of schools in Riverton City. The number of school of moral philosophy in Monarch's Hill equals the number of elementary school in Oakbridge City. The number of wind turbine design academy in Oldbridge equals the number of elementary school in Oakbridge City. The number of astronaut training academy in Heritagedale equals the difference between the total number of schools in Riverton City and the number of elementary school in Oakbridge City. The number of school of coral reef studies in Kingsford equals the number of elementary school in Oakbridge City. The number of forestry management institute in Queensmeadow equals the sum of the total number of schools in Riverton City and the number of culinarian school in Riverton City. The number of air traffic control institute in Kingsford equals the total number of schools in Riverton City. The number of school of metaphysics in Monarch's Hill equals the number of culinarian school in Clearwater Bay. The number of intergalactic diplomacy academy in Heritagedale equals the total number of schools in Riverton City. The number of school of mobile app development in Colonial Hollow equals the difference between the number of culinarian school in Oakbridge City and the total number of schools in Riverton City. The number of school of terraforming in Heritagedale equals the number of elementary school in Clearwater Bay. The number of drone navigation conservatory in Monarch's Hill equals the number of elementary school in Clearwater Bay. ", "question": "How many culinarian school does Riverton City have?", "solution": "The question is difficult, so we use equations to solve it. Define culinarian school in Riverton City as x; we don't know its value yet but will find it out later. Define total number of schools in Riverton City as T; so T = x = x. Define culinarian school in Oakbridge City as J; so J = T = x. We know J = 3, so we have x = 3 and we solve it through the following steps: Simplifying the equation: x = 3. Move all terms to one side: x - 3 = 0. Isolate the term with x: 1*x = 3. Divide both sides by 1: x = 3 / 1. Solution: x = 3. Answer: 3.", "op": 3, "id": 6, "template": "teachers_in_school", "mode": "forwardreverse", "length": "8k", "d": 2}
{"problem": "The number of film about cricket match political allegory in Frames of Grace Cinema Gala equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about cursed forest horror fantasy in Frames of Grace Cinema Gala equals the total number of movies in Festival Lumière de Valmont. The number of film about phoenix kingdom civil war in Frames of Grace Cinema Gala equals the total number of movies in Festival Lumière de Valmont. The number of intense detective thriller in Festival de Clairmont equals 3 plus the difference between the total number of movies in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about icelandic volcanic disaster epic in Rhythmic Motion Film Festival equals the number of intense detective thriller in Rêves de Belleville. The number of film about crystal castle explorer's journey in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about australian outback sci-fi western in Rhythmic Motion Film Festival equals the sum of the number of upbeat metropolis comedy in Rêves de Belleville and the total number of movies in The Choreographer's Lens Festival. The number of elemental wizard rivalry drama in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival de Clairmont. The number of underground fight club drama in Frames of Grace Cinema Gala equals the difference between the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival Lumière de Valmont. The number of film about caribbean pirate love triangle in Rhythmic Motion Film Festival equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about genetic experiment rebellion story in Rhythmic Motion Film Festival equals the difference between the number of intense detective thriller in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Rêves de Belleville. The number of 80's neon crime drama in The Choreographer's Lens Festival equals the difference between the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival de Clairmont. The number of biopunk corporate espionage drama in Rhythmic Motion Film Festival equals the difference between the number of upbeat metropolis comedy in Festival de Clairmont and the total number of movies in Step into Frames Film Awards. The number of film about chinese dynasty martial arts mystery in Rhythmic Motion Film Festival equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about terraforming pioneer family saga in Rhythmic Motion Film Festival equals the number of intense detective thriller in Rêves de Belleville. The number of film about forbidden love in the world of fencing in Frames of Grace Cinema Gala equals the number of intense detective thriller in Rêves de Belleville. The number of upbeat metropolis comedy in Festival de Clairmont equals the total number of movies in Festival Lumière de Valmont. The number of film about android detective noir in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about quantum-entangled romance saga in Rhythmic Motion Film Festival equals the number of intense detective thriller in Rêves de Belleville. The number of track and field historical drama in Frames of Grace Cinema Gala equals the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about himalayan monastery enlightenment story in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about lost island tribal epic in Frames of Grace Cinema Gala equals the difference between the number of intense detective thriller in Festival de Clairmont and the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about cloud city romance adventure in Frames of Grace Cinema Gala equals the difference between the number of upbeat metropolis comedy in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of film about time-looping wizard saga in Frames of Grace Cinema Gala equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about african tribal sci-fi allegory in Rhythmic Motion Film Festival equals the difference between the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival de Clairmont. The number of intense detective thriller in Festival Lumière de Valmont exists, and its number is greater than 0. The number of martian colony survival drama in Rhythmic Motion Film Festival equals the difference between the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival Lumière de Valmont. The number of film about dragon hunter revenge saga in Frames of Grace Cinema Gala equals the number of intense detective thriller in Rêves de Belleville. The number of film about underdog ice hockey tale in Step into Frames Film Awards equals the number of intense detective thriller in Festival de Clairmont. The number of film about olympic dreams shattered and reborn in Frames of Grace Cinema Gala equals the difference between the number of intense detective thriller in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of dreamscape travel thriller in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about cryo-sleep murder mystery in Rhythmic Motion Film Festival equals the number of intense detective thriller in Rêves de Belleville. The number of film about russian winter survival horror in Rhythmic Motion Film Festival equals the total number of movies in Festival Lumière de Valmont. The number of underground dome resistance thriller in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival Lumière de Valmont. The number of norwegian fjord myth thriller in Rhythmic Motion Film Festival equals the difference between the number of intense detective thriller in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of film about soul-bound warrior vengeance story in Frames of Grace Cinema Gala equals the total number of movies in Festival Lumière de Valmont. The number of magic school survival thriller in Frames of Grace Cinema Gala equals the number of intense detective thriller in Rêves de Belleville. The number of film about french vineyard ghost love story in Rhythmic Motion Film Festival equals the sum of the number of upbeat metropolis comedy in Rêves de Belleville and the number of intense detective thriller in Rêves de Belleville. The number of film about underwater merfolk rebellion in Frames of Grace Cinema Gala equals the sum of the number of upbeat metropolis comedy in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of film about golem maker's tragedy in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival Lumière de Valmont. The number of intergalactic trade heist thriller in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival de Clairmont. The number of midnight drag racing thriller in Frames of Grace Cinema Gala equals the difference between the number of intense detective thriller in Rêves de Belleville and the total number of movies in Festival Lumière de Valmont. The number of film about rebellion in a futuristic combat sport in Frames of Grace Cinema Gala equals the sum of the number of intense detective thriller in Festival Lumière de Valmont and the total number of movies in Festival Lumière de Valmont. The number of film about post-apocalyptic desert opera in Rhythmic Motion Film Festival equals the sum of the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival Lumière de Valmont. The number of upbeat metropolis comedy in Rêves de Belleville equals the number of intense detective thriller in Rêves de Belleville. The number of film about dragon hunter revenge saga in Dances of the World Fest equals the number of intense detective thriller in Festival Lumière de Valmont. The number of rooftop basketball street drama in Frames of Grace Cinema Gala equals the sum of the number of intense detective thriller in Festival Lumière de Valmont and the number of intense detective thriller in Festival de Clairmont. The number of brazilian carnival romance drama in Rhythmic Motion Film Festival equals the sum of the number of intense detective thriller in Festival Lumière de Valmont and the total number of movies in Dances of the World Fest. The number of film about ballet dancer turned martial artist saga in Frames of Grace Cinema Gala equals the sum of the total number of movies in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Festival de Clairmont. The number of motocross racing family drama in Frames of Grace Cinema Gala equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of rowing crew betrayal drama in Frames of Grace Cinema Gala equals the number of intense detective thriller in Rêves de Belleville. The number of film about high-altitude mountaineering rivalry in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival de Clairmont. The number of competitive esports rivalry thriller in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival Lumière de Valmont. The number of nanobot epidemic thriller in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about fae versus human love story in Frames of Grace Cinema Gala equals the sum of the number of intense detective thriller in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of fairy tale noir detective drama in Frames of Grace Cinema Gala equals the difference between the number of upbeat metropolis comedy in Festival de Clairmont and the number of intense detective thriller in Festival de Clairmont. The number of alien language mystery thriller in Rhythmic Motion Film Festival equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of middle eastern djinn folklore drama in Rhythmic Motion Film Festival equals the total number of movies in Festival Lumière de Valmont. The number of elf kingdom political drama in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about gothic vampire court intrigue in Frames of Grace Cinema Gala equals the difference between the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival Lumière de Valmont. The number of film about ancient artifact adventure mystery in Frames of Grace Cinema Gala equals the number of intense detective thriller in Festival de Clairmont. The number of film about time-travel bounty hunter epic in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about holographic artist revenge saga in Rhythmic Motion Film Festival equals the sum of the number of upbeat metropolis comedy in Rêves de Belleville and the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about steam-powered kingdom heist in Frames of Grace Cinema Gala equals the difference between the number of intense detective thriller in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about italian renaissance art heist in Rhythmic Motion Film Festival equals the sum of the number of intense detective thriller in Rêves de Belleville and the total number of movies in Festival Lumière de Valmont. The number of film about boxing in 1920's harlem in Frames of Grace Cinema Gala equals the difference between the number of intense detective thriller in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of south african apartheid time-travel drama in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival Lumière de Valmont. The number of film about greek island time-travel romance in Rhythmic Motion Film Festival equals the sum of the number of intense detective thriller in Festival de Clairmont and the number of intense detective thriller in Festival Lumière de Valmont. The number of space station political thriller in Rhythmic Motion Film Festival equals the sum of the number of intense detective thriller in Festival Lumière de Valmont and the number of intense detective thriller in Festival de Clairmont. The number of elf kingdom political drama in Dances of the World Fest equals the difference between the number of intense detective thriller in Festival de Clairmont and the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about ping-pong prodigy comeback story in Frames of Grace Cinema Gala equals the difference between the number of intense detective thriller in Rêves de Belleville and the number of intense detective thriller in Festival de Clairmont. The number of korean historical thriller noir in Rhythmic Motion Film Festival equals the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about soccer coach redemption tale in Frames of Grace Cinema Gala equals the number of intense detective thriller in Rêves de Belleville. The number of synchronized swimming dark comedy in Frames of Grace Cinema Gala equals the sum of the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Rêves de Belleville. The number of film about indian cosmic musical epic in Rhythmic Motion Film Festival equals the difference between the total number of movies in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about galactic space-race adventure in Rhythmic Motion Film Festival equals the sum of the number of intense detective thriller in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about downhill skiing survival story in Frames of Grace Cinema Gala equals the difference between the number of upbeat metropolis comedy in Festival de Clairmont and the number of intense detective thriller in Rêves de Belleville. The number of upbeat metropolis comedy in Festival de Clairmont equals 3. The number of virtual reality addiction drama in Rhythmic Motion Film Festival equals the difference between the total number of movies in Festival Lumière de Valmont and the number of intense detective thriller in Festival Lumière de Valmont. The number of film about japanese cyberpunk samurai duel in Rhythmic Motion Film Festival equals the difference between the number of upbeat metropolis comedy in Festival de Clairmont and the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about tibetan sky burial mystery in Rhythmic Motion Film Festival equals the number of intense detective thriller in Rêves de Belleville. The number of film about celtic druidic fantasy epic in Rhythmic Motion Film Festival equals the difference between the total number of movies in Festival Lumière de Valmont and the total number of movies in Frames of Grace Cinema Gala. The number of intense detective thriller in Rêves de Belleville equals 4. The number of film about mythical beast gladiator tournament in Frames of Grace Cinema Gala equals the difference between the total number of movies in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about neo-tokyo mecha romance in Rhythmic Motion Film Festival equals the total number of movies in Festival Lumière de Valmont. The number of film about underdog ice hockey tale in Frames of Grace Cinema Gala equals the number of upbeat metropolis comedy in Festival de Clairmont. The number of film about mexican day of the dead road trip in Rhythmic Motion Film Festival equals the number of intense detective thriller in Festival de Clairmont. The number of robot gladiator sports drama in Rhythmic Motion Film Festival equals the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about artificial intelligence coming-of-age story in Rhythmic Motion Film Festival equals the difference between the number of intense detective thriller in Festival Lumière de Valmont and the number of upbeat metropolis comedy in Rêves de Belleville. The number of film about high school baseball revenge saga in Frames of Grace Cinema Gala equals the sum of the number of intense detective thriller in Rêves de Belleville and the number of intense detective thriller in Festival de Clairmont. ", "question": "How many intense detective thriller does Festival Lumière de Valmont have?", "solution": "The question is difficult, so we use equations to solve it. Define intense detective thriller in Festival Lumière de Valmont as x; we don't know its value yet but will find it out later. Define total number of movies in Festival Lumière de Valmont as T; so T = x = x. Define upbeat metropolis comedy in Festival de Clairmont as J; so J = T = x. We know J = 3, so we have x = 3 and we solve it through the following steps: Simplifying the equation: x = 3. Move all terms to one side: x - 3 = 0. Isolate the term with x: 1*x = 3. Divide both sides by 1: x = 3 / 1. Solution: x = 3. Answer: 3.", "op": 3, "id": 15, "template": "movie_festival_awards", "mode": "forwardreverse", "length": "8k", "d": 2}
